[{"title":"These are the best gold investing strategies right now, experts say","description":"You may want to utilize various investing strategies, depending on the gold benefits you want to add to your portfolio.","url":"https://www.cbsnews.com/news/these-are-the-best-gold-investing-strategies-right-now-experts-say/","publishedAt":"2024-07-18T15:04:05Z","SourceName":"cbsnews"},{"title":"Canada to quadruple sub fleet as NATO, Russia and China eye the Arctic","description":"Canada plans to buy 12 new submarines as the U.S. and its allies and adversaries step up operations in the thawing Arctic.","url":"https://www.cbsnews.com/news/canada-nato-submarines-arctic-defense-russia-china-northern-sea-route/","publishedAt":"2024-07-18T15:01:00Z","SourceName":"cbsnews"},{"title":"Live Updates: New details in Trump shooting emerge amid investigations","description":"The U.S. Secret Service is facing mounting questions about the security flaws that allowed the shooter to fire from a rooftop near the rally.","url":"https://www.cbsnews.com/live-updates/trump-rally-shooting-investigation/","publishedAt":"2024-07-18T14:41:00Z","SourceName":"cbsnews"},{"title":"Trump shooter's phone had details on Trump and Biden; Senators confront Secret Service director","description":"FBI officials told congressional members Wednesday the gunman who tried to assassinate former President Donald Trump had used his cellphone and other devices to search for images of both Trump and President Biden. Also on Wednesday, GOP senators at the Republican National Convention confronted Secret Service director Kimberly Cheatle, who's now facing calls to resign over the assassination attempt. CBS News' Charlie De Mar and Nikole Killion have more.","url":"https://www.cbsnews.com/video/trump-shooters-phone-had-details-on-trump-and-biden-senators-confront-secret-service-director/","publishedAt":"2024-07-18T14:35:00Z","SourceName":"cbsnews"},{"title":"Exclusive discounts from CBS Mornings Deals","description":"On this edition of CBS Mornings Deals, Adriane Kiss shows us items that might just become essentials in your everyday life. Visit cbsdeals.com to take advantage of these exclusive deals today. CBS earns commissions on purchases made through cbsdeals.com.","url":"https://www.cbsnews.com/video/cbs-mornings-deals-071824/","publishedAt":"2024-07-18T14:29:00Z","SourceName":"cbsnews"},{"title":"Sheryl Lee Ralph talks new film, \"The Fabulous Four,\" and latest Emmy nominations","description":"Emmy award-winning actor Sheryl Lee Ralph joins \"CBS Mornings\" to talk about her new comedy, \"The Fabulous Four,\" and her third Emmy nomination for \"Abbott Elementary.\"","url":"https://www.cbsnews.com/video/sheryl-lee-ralph-talks-new-film-the-fabulous-four-and-latest-emmy-nominations/","publishedAt":"2024-07-18T14:28:00Z","SourceName":"cbsnews"},{"title":"Home security systems and carbon monoxide detection: What to know now","description":"Here's why including carbon monoxide detection in your home security system is so important.","url":"https://www.cbsnews.com/news/home-security-systems-and-carbon-monoxide-detection-what-to-know-now/","publishedAt":"2024-07-18T14:21:36Z","SourceName":"cbsnews"},{"title":"Sheriff's deputy charged in fatal shooting of woman who called 911","description":"Sonya Massey was killed after Sangamon County deputies responded to her 911 call about an intruder early on July 6, officials said.","url":"https://www.cbsnews.com/news/sonya-massey-killed-sangamon-county-deputy-sean-grayson-charged-murder-illinois/","publishedAt":"2024-07-18T14:14:00Z","SourceName":"cbsnews"},{"title":"Recapping the immigration message on Day 3 of RNC","description":"Speakers at Day 3 of the Republican National Convention focused on immigration and border patrol. CBS News' Tony Dokoupil has more on the rhetoric those speakers used in their addresses.","url":"https://www.cbsnews.com/video/recapping-the-immigration-message-on-day-3-of-rnc/","publishedAt":"2024-07-18T14:05:00Z","SourceName":"cbsnews"},{"title":"Content creator dies in fall shooting videos at Indian beauty spot","description":"Indian influencer Aanvi Kamdar was shooting Instagram reels at the popular Kumbhe waterfall when she slipped into a 300-foot deep gorge.","url":"https://www.cbsnews.com/news/aanvi-kamdar-india-instagram-creator-dies-accident-kumbhe-waterfall/","publishedAt":"2024-07-18T14:04:51Z","SourceName":"cbsnews"},{"title":"Lara Trump says Americans may see a \"different version\" of Trump tonight","description":"Former President Donald Trump is set to speak Thursday night at the Republican National Convention.","url":"https://www.cbsnews.com/news/lara-trump-rnc-donald-trump-speech-assassination-attempt/","publishedAt":"2024-07-18T13:58:26Z","SourceName":"cbsnews"},{"title":"Oprah's Book Club: Author David Wroblewski discusses reader's guide for \"Familiaris\"","description":"Oprah Winfrey selected \"Familiaris\" by David Wroblewski as her latest book club selection. Watch as author David Wroblewski answers reader's guide questions about his novel.","url":"https://www.cbsnews.com/video/oprahs-book-club-author-david-wroblewski-discusses-readers-guide-for-familiaris/","publishedAt":"2024-07-18T13:51:00Z","SourceName":"cbsnews"},{"title":"Oprah's Book Club: Author David Wroblewski reads \"Familiaris\" excerpt","description":"Oprah Winfrey selected \"Familiaris\" by David Wroblewski as her latest book club pick. Watch the author, David Wroblewski, read an excerpt from his long-awaited follow-up to his bestselling debut, \"The Story of Edgar Sawtelle.\"","url":"https://www.cbsnews.com/video/oprahs-book-club-author-david-wroblewski-reads-familiaris-excerpt/","publishedAt":"2024-07-18T13:51:00Z","SourceName":"cbsnews"},{"title":"Republicans react to Trump's controversial quotes ahead of RNC speech","description":"As former President Trump prepares for his RNC speech, \"CBS Mornings\" co-host Tony Dokoupil explores the interpretation of some of Trump's most controversial quotes.","url":"https://www.cbsnews.com/video/republicans-react-to-trumps-controversial-quotes-ahead-of-rnc-speech/","publishedAt":"2024-07-18T13:40:00Z","SourceName":"cbsnews"},{"title":"Trump shooter called July 13 his \"premiere\" in online post, sources say","description":"The message, posted on an online gaming platform, was found amid a search for a motive in the shooting of former President Donald Trump.","url":"https://www.cbsnews.com/news/trump-shooter-thomas-matthew-crooks-called-july-13-premiere-online-post-assassination-attempt/","publishedAt":"2024-07-18T13:29:00Z","SourceName":"cbsnews"},{"title":"Seven members of same family killed in suspected arson attack in Nice","description":"Authorities in Nice, southern France, say images show hooded people dousing a stairwell with liquid before a suspected arson fire that killed 7 people.","url":"https://www.cbsnews.com/news/nice-france-fire-kills-7-members-of-same-family-including-3-children/","publishedAt":"2024-07-18T13:26:57Z","SourceName":"cbsnews"},{"title":"Biden reportedly told by Pelosi that he cannot beat Trump","description":"President Biden has reportedly been told privately by former House Speaker Nancy Pelosi that polls show he cannot defeat Donald Trump in November. The reports come as Biden isolates in Delaware due to a case of COVID-19. CBS News White House reporter Willie James Inman has the latest on Biden's campaign and Democratic strategist and CBS News political contributor Joel Payne has analysis of the situation.","url":"https://www.cbsnews.com/video/biden-reportedly-told-by-pelosi-that-he-cannot-beat-trump/","publishedAt":"2024-07-18T13:20:00Z","SourceName":"cbsnews"},{"title":"Lara Trump discusses assassination attempt on Donald Trump, its impact on family and RNC","description":"Former President Donald Trump's daughter-in-law, Lara Trump, discusses the assassination attempt on her father-in-law and how it will impact his speech on the final night of the Republican National Convention.","url":"https://www.cbsnews.com/video/lara-trump-discusses-assassination-attempt-on-donald-trump-its-impact-on-family-and-rnc/","publishedAt":"2024-07-18T13:18:00Z","SourceName":"cbsnews"},{"title":"Analysis of RNC, Biden campaign as more Democrats call for president to step down","description":"CBS News' Senior White House and political correspondent Ed O'Keefe and chief election and campaign correspondent Robert Costa break down what happened at the Republican National Convention and where the Biden campaign stands amid turmoil.","url":"https://www.cbsnews.com/video/analysis-of-rnc-biden-campaign-as-more-democrats-call-for-president-to-step-down/","publishedAt":"2024-07-18T12:58:00Z","SourceName":"cbsnews"},{"title":"Eye Opener: JD Vance makes his first speech as Donald Trump's running mate","description":"Sen. JD Vance makes his first speech as Donald Trump's running mate. Also, President Biden battles COVID and faces new calls from fellow Democrats to step aside in the presidential race  All that and all that matters in today's Eye Opener.","url":"https://www.cbsnews.com/video/eye-opener-jd-vance-makes-his-first-speech-as-donald-trumps-running-mate/","publishedAt":"2024-07-18T12:57:00Z","SourceName":"cbsnews"},{"title":"What to know as Social Security recipients have to update their online accounts","description":"CBS News business analyst Jill Schlesinger explains a change to online Social Security accounts that will impact millions of beneficiaries.","url":"https://www.cbsnews.com/video/what-to-know-as-social-security-recipients-have-to-update-their-online-accounts/","publishedAt":"2024-07-18T12:57:00Z","SourceName":"cbsnews"},{"title":"Ingrid Ciprián-Matthews inducted into NAHJ Hall of Fame","description":"Ingrid Ciprián-Matthews, the first Latina to lead the news division, was inducted into the National Association of Hispanic Journalists' Hall of Fame.","url":"https://www.cbsnews.com/news/cbs-news-president-ingrid-ciprian-matthews-nahj-hall-of-fame/","publishedAt":"2024-07-18T12:45:40Z","SourceName":"cbsnews"},{"title":"JD Vance speaks at RNC, accepting nomination for vice president","description":"Donald Trump's vice presidential nominee, JD Vance, spoke at the Republican National Convention Wednesday, formally accepting the GOP's nomination. In his speech, Vance made an appeal to working-class Americans and went after President Biden. Trump is expected to speak at the convention Thursday.","url":"https://www.cbsnews.com/video/jd-vance-speaks-at-rnc-accepting-nomination-for-vice-president/","publishedAt":"2024-07-18T12:40:00Z","SourceName":"cbsnews"},{"title":"New calls for Biden to step down from candidacy as he battles COVID","description":"President Biden cut a campaign trip short Wednesday after he tested positive for COVID. The president was in Nevada trying to shore up support in the battleground state. Meanwhile, he faces new calls to step down from the candidacy, including from California Rep. Adam Schiff.","url":"https://www.cbsnews.com/video/new-calls-for-biden-to-step-down-from-candidacy-as-he-battles-covid/","publishedAt":"2024-07-18T12:39:00Z","SourceName":"cbsnews"},{"title":"The message Republicans are trying to spread with JD Vance","description":"JD Vance officially accepted the Republican nomination for vice president Wednesday night, discussing his Rust Belt roots and family while addressing the Republican National Convention. CBS News campaign reporter Olivia Rinaldi has more on why the GOP and Donald Trump picked Vance for the ticket.","url":"https://www.cbsnews.com/video/the-message-republicans-are-trying-to-spread-with-jd-vance/","publishedAt":"2024-07-18T12:36:00Z","SourceName":"cbsnews"},{"title":"See the full list of Kennedy Center honorees","description":"\"CBS Mornings\" got an exclusive first look at the 47th class of Kennedy Center honorees, who will be celebrated for their lifetime artistic achievements and impact on American culture.","url":"https://www.cbsnews.com/news/2024-kennedy-center-honorees-include-grateful-dead-bonnie-raitt-among-others/","publishedAt":"2024-07-18T12:35:39Z","SourceName":"cbsnews"},{"title":"2024 Kennedy Center honorees revealed on \"CBS Mornings\"","description":"The 47th class of Kennedy Center honorees was revealed on \"CBS Mornings\" Thursday. The star-studded list of recipients includes award-winning filmmaker Francis Ford Coppola, legendary rock band the Grateful Dead, blues rock singer-songwriter Bonnie Raitt, jazz musician and composer Arturo Sandoval and the Apollo.","url":"https://www.cbsnews.com/video/2024-kennedy-center-honorees-revealed-on-cbs-mornings/","publishedAt":"2024-07-18T11:53:00Z","SourceName":"cbsnews"},{"title":"Arrests made after woman's body found in toolbox in Vermont river","description":"Kayla Wright's body was found in a truck-bed-style toolbox on a sandbar in the Missisquoi River in February.","url":"https://www.cbsnews.com/news/kayla-wright-murder-arrests-body-found-toolbox-missisquoi-river-vermont/","publishedAt":"2024-07-18T11:08:00Z","SourceName":"cbsnews"},{"title":"RNC Day 4: Trump to accept GOP presidential nomination","description":"Former President Donald Trump is slated to accept the GOP's nomination for president on the fourth and last day of the Republican National Convention.","url":"https://www.cbsnews.com/news/rnc-day-4-speakers-schedule/","publishedAt":"2024-07-18T11:00:12Z","SourceName":"cbsnews"},{"title":"Alabama set to execute convicted murderer, then skip autopsy","description":"A man convicted of killing a delivery driver who stopped for cash at an ATM to take his wife to dinner is scheduled for execution in Alabama, which has agreed to forgo the usual post-execution autopsy.","url":"https://www.cbsnews.com/news/alabama-set-to-execute-convicted-murderer-then-skip-post-execution-autopsy/","publishedAt":"2024-07-18T10:32:00Z","SourceName":"cbsnews"},{"title":"Trump's plan to tackle inflation could cause price spikes, experts say","description":"Although Donald Trump vows to bring U.S. prices down \"very quickly,\" some economists say his policies could rekindle inflation. Here's what to know.","url":"https://www.cbsnews.com/news/trump-economy-inflation-tariffs-tax-cuts-immigration/","publishedAt":"2024-07-19T09:00:07Z","SourceName":"cbsnews"},{"title":"Here's what some Olympic athletes get instead of cash prizes","description":"Cash, cars and even cows are just a few ways some nations reward their medal-winning Olympic athletes.","url":"https://www.cbsnews.com/news/2024-olympics-paris-athletes-medals-prize-money/","publishedAt":"2024-07-19T09:00:06Z","SourceName":"cbsnews"},{"title":"Microsoft users around the world report widespread outages","description":"Banks, airlines, broadcasters and health systems in countries around the world reported widespread outages Friday in relation to Microsoft's 365 apps.","url":"https://www.cbsnews.com/news/microsoft-internet-outages-reported-worldwide/","publishedAt":"2024-07-19T08:25:00Z","SourceName":"cbsnews"},{"title":"Trump delivers 2024 Republican National Convention speech","description":"Former President Donald Trump closed Day 4 of the 2024 Republican National Convention with a speech, his first major public remarks since the assassination attempt at a Pennsylvania campaign rally. Watch his full remarks.","url":"https://www.cbsnews.com/video/trump-delivers-2024-republican-national-convention-speech-1/","publishedAt":"2024-07-19T07:39:24Z","SourceName":"cbsnews"},{"title":"Trump accepts GOP nomination with lengthy RNC speech, his first since shooting","description":"\"I am not supposed to be here tonight,\" former President Donald Trump said. \"I stand before you in this arena only by the grace of almighty God.\"","url":"https://www.cbsnews.com/live-updates/rnc-2024-day-4/","publishedAt":"2024-07-19T04:52:00Z","SourceName":"cbsnews"},{"title":"Fact check of Trump, others on Day 4 of the Republican National Convention","description":"CBS News is fact checking statements made by GOP speakers on the fourth and final night of the 2024 RNC, when Donald Trump addresses the convention.","url":"https://www.cbsnews.com/news/2024-rnc-day-4-fact-check-republican-national-convention-trump/","publishedAt":"2024-07-19T04:38:53Z","SourceName":"cbsnews"},{"title":"Trump on assassination attempt: \"I'm not supposed to be here\"","description":"Former President Donald Trump publicly recounted the assassination attempt for the first time during a speech at the Republican National Convention.","url":"https://www.cbsnews.com/news/donald-trump-rnc-speech-assassination-attempt/","publishedAt":"2024-07-19T04:30:10Z","SourceName":"cbsnews"},{"title":"Houthis claim drone strike on Tel Aviv that Israel says killed 1","description":"Israel's military says a drone attack launched from Yemen has killed 1 person in Tel Aviv and left at least 8 others wounded.","url":"https://www.cbsnews.com/news/deadly-tel-aviv-explosion-israel/","publishedAt":"2024-07-19T04:24:00Z","SourceName":"cbsnews"},{"title":"Watch: Trump's 2024 RNC entrance","description":"Former President Donald Trump made a dramatic entrance on the final night of the 2024 Republican National Convention, walking on stage with his last name behind him in bright lights.","url":"https://www.cbsnews.com/video/watch-trump-2024-rnc-entrance/","publishedAt":"2024-07-19T03:53:00Z","SourceName":"cbsnews"},{"title":"Trump shooting investigations focus on motive, security failures","description":"The U.S. Secret Service is facing mounting questions about the security flaws that allowed the shooter to fire from a rooftop near the rally.","url":"https://www.cbsnews.com/live-updates/trump-rally-shooting-investigation/","publishedAt":"2024-07-19T03:45:00Z","SourceName":"cbsnews"},{"title":"Trump pays tribute to Pennsylvania firefighter killed in rally shooting","description":"Former President Donald Trump placed Corey Comperatore's firefighting helmet and jacket on stage during his address at the Republican National Convention.","url":"https://www.cbsnews.com/news/trump-tribute-pennsylvania-firefighter-corey-comperatore-killed-rally/","publishedAt":"2024-07-19T03:23:52Z","SourceName":"cbsnews"},{"title":"Detroit pastor Lorenzo Sewell speaks at the RNC","description":"Michigan pastor Lorenzo Sewell addressed the 2024 Republican National Convention on Thursday, one month after former President Donald Trump visited his church in Detroit. \"He came to the hood because he cares about average, everyday Americans,\" Sewell said.","url":"https://www.cbsnews.com/video/detroit-pastor-lorenzo-sewell-speaks-rnc/","publishedAt":"2024-07-19T02:57:00Z","SourceName":"cbsnews"},{"title":"Melania Trump arrives at 2024 Republican National Convention","description":"Melania Trump made her first appearance at the 2024 Republican National Convention on Thursday night. The former first lady has been largely absent from the campaign trail this election cycle. \"CBS Evening News\" anchor and managing editor Norah O'Donnell leads special coverage.","url":"https://www.cbsnews.com/video/melania-trump-arrives-2024-republican-national-convention/","publishedAt":"2024-07-19T02:56:00Z","SourceName":"cbsnews"},{"title":"2 senior House Democrats believe Biden could leave race in days","description":"Two senior House Democrats believe Biden could leave the 2024 presidential race within days after a pressure campaign from top Democratic lawmakers.","url":"https://www.cbsnews.com/news/biden-could-leave-2024-race-2-senior-house-democrats-believe/","publishedAt":"2024-07-19T02:56:00Z","SourceName":"cbsnews"},{"title":"Climate protesters steer clear of Republican National Convention","description":"Many protesters stayed away, but one group found a unique way to draw attention to the climate crisis during the RNC in Milwaukee.","url":"https://www.cbsnews.com/news/climate-protesters-rnc-republicans/","publishedAt":"2024-07-19T02:34:29Z","SourceName":"cbsnews"},{"title":"Eric Trump speaks at RNC, recalls his father's decision to run for president in 2016","description":"During his speech at the Republican National Convention, former President Donald Trump's son, Eric Trump, spoke about why his father decided to run for president in 2016. Eric Trump denounced the criminal investigations against his father, claiming he's being persecuted.","url":"https://www.cbsnews.com/video/eric-trump-donald-trump-rnc-speech-day-4/","publishedAt":"2024-07-19T02:21:00Z","SourceName":"cbsnews"},{"title":"Hulk Hogan calls Trump a \"real American hero,\" rips off shirt during RNC speech","description":"Retired professional wrestler Hulk Hogan took the stage on the final night of the Republican National Convention and said former President Donald Trump is a \"real American hero.\" He ripped off his shirt to reveal a red Trump-Vance campaign shirt.","url":"https://www.cbsnews.com/video/hulk-hogan-calls-trump-real-american-hero-rips-off-shirt-rnc-speech/","publishedAt":"2024-07-19T01:55:00Z","SourceName":"cbsnews"},{"title":"Trump shooter searched for rally site photos, used encrypted platforms, sources say","description":"Briefers told lawmakers they are still attempting to access three foreign encrypted platforms the gunman, Thomas Matthew Crooks, used on his cellphone, sources told CBS News.","url":"https://www.cbsnews.com/news/trump-shooting-online-evidence-lawmaker-briefings/","publishedAt":"2024-07-19T01:53:00Z","SourceName":"cbsnews"},{"title":"Montana's Jon Tester calls on Biden to withdraw from presidential race","description":"Democratic Sen. Jon Tester of Montana said President Biden should not seen another term in the White House.","url":"https://www.cbsnews.com/news/jon-tester-joe-biden-2024-race-call-to-withdraw/","publishedAt":"2024-07-19T01:42:00Z","SourceName":"cbsnews"},{"title":"Sen. Marco Rubio says Trump has been \"very impressed\" by RNC","description":"Sen. Marco Rubio of Florida says former President Donald Trump has been \"very impressed\" by the production at the Republican National Convention. He joins CBS News to discuss Ukraine, Trump's policy to secure the U.S.-Mexico border, and more.","url":"https://www.cbsnews.com/video/sen-marco-rubio-says-trump-has-been-very-impressed-by-rnc/","publishedAt":"2024-07-19T01:29:00Z","SourceName":"cbsnews"},{"title":"Democratic Sen. Jon Tester says Biden shouldn't seek reelection","description":"Democratic Sen. Jon Tester of Montana came out against President Biden's reelection bid on Thursday night. Tester is the second Democratic senator to call on Biden to exit the 2024 race. \"CBS Evening News\" anchor and managing editor Norah O'Donnell leads special coverage.","url":"https://www.cbsnews.com/video/democratic-sen-jon-tester-says-biden-shouldnt-seek-reelection/","publishedAt":"2024-07-19T01:14:00Z","SourceName":"cbsnews"},{"title":"Michigan senator says he gave Biden campaign his candid assessment about 2024 race","description":"Democratic Sen. Gary Peters of Michigan says he's been talking to President Biden's campaign team and voicing his views and concerns about how close the 2024 race is, and the challenges the Democrats face to maintain control of the Senate and the White House.","url":"https://www.cbsnews.com/video/michigan-senator-gary-peters-biden-campaign-candid-assessment-2024-race/","publishedAt":"2024-07-19T01:13:00Z","SourceName":"cbsnews"},{"title":"Democratic Rep. Jim Costa calls on Biden to exit race","description":"Democratic Rep. Jim Costa of California on Thursday night called on President Biden to drop out of the 2024 race. Costa is the latest member of the president's party to call for his exit. CBS News chief election and campaign correspondent Robert Costa, no relation, has the details.","url":"https://www.cbsnews.com/video/democratic-rep-jim-costa-calls-on-biden-to-exit-race/","publishedAt":"2024-07-19T00:58:00Z","SourceName":"cbsnews"},{"title":"Rep. Jamie Raskin urges Biden to reconsider reelection bid","description":"President Biden's COVID-19 diagnosis has taken him off the campaign trail in yet another setback as he contends with mounting pressure to drop out of the race. On Thursday, a July 6 letter from Rep. Jamie Raskin of Maryland surfaced in which he urged the president to reconsider his reelection bid. Kadia Goba, politics reporter for Semafor, joins \"America Decides\" with more.","url":"https://www.cbsnews.com/video/jamie-raskin-urges-biden-to-reconsider-reelection-bid/","publishedAt":"2024-07-19T00:44:00Z","SourceName":"cbsnews"},{"title":"Concerns about Biden campaign donations grow amid pressure for him to drop out of 2024 race","description":"There are concerns President Biden's reelection campaign could run out of money amid mounting pressure for him to drop out of the 2024 race. CBS News chief election and campaign correspondent Robert Costa reports.","url":"https://www.cbsnews.com/video/biden-campaign-donations-pressure-drop-out-2024-race/","publishedAt":"2024-07-19T00:07:00Z","SourceName":"cbsnews"},{"title":"Trump will not mention Biden by name in RNC speech, campaign's senior adviser says","description":"Former President Donald Trump will not mention President Biden by name during his speech at the Republican National Convention on Thursday, Trump campaign senior adviser Danielle Alvarez tells Major Garrett on \"America Decides.\" Alvarez has more on Trump's upcoming speech and his 2024 campaign.","url":"https://www.cbsnews.com/video/trump-will-not-mention-biden-by-name-in-rnc-speech-campaigns-senior-adviser-says/","publishedAt":"2024-07-19T00:07:00Z","SourceName":"cbsnews"},{"title":"Maternal deaths found to be highest in states with abortion restrictions","description":"New research finds that states with strict abortion restrictions are seeing higher rates of maternal deaths. The Commonwealth Fund analyzed data from 2021 through 2022 following the overturning of Roe v. Wade and the subsequent enactment of state abortion laws. Dr. Carolyn Sufrin, associate professor of gynecology and obstetrics at Johns Hopkins School of Medicine, joins CBS News to discuss.","url":"https://www.cbsnews.com/video/maternal-deaths-highest-in-states-with-abortion-restrictions/","publishedAt":"2024-07-19T00:06:00Z","SourceName":"cbsnews"},{"title":"Milwaukee voters weigh in on 2024 presidential race","description":"To hear what is on the minds of voters regarding the 2024 presidential election and the political rhetoric surrounding it, \"CBS Evening News\" anchor and managing editor Norah O'Donnell sat down with supporters of President Biden and former President Donald Trump, along with several undecided voters at a brewery in Milwaukee.","url":"https://www.cbsnews.com/video/milwaukee-voters-weigh-in-on-2024-presidential-race/","publishedAt":"2024-07-18T23:50:00Z","SourceName":"cbsnews"},{"title":"Nonprofit seeks to bridge the political divide through meaningful conversation","description":"An initiative from the nonprofit group StoryCorps seeks to find common ground through shared stories.","url":"https://www.cbsnews.com/news/bridge-political-divide-through-conversations-storycorps/","publishedAt":"2024-07-18T23:44:52Z","SourceName":"cbsnews"},{"title":"Comedy icon Bob Newhart dies at 94","description":"Legendary comedian Bob Newhart, known for his trademark deadpan delivery, has died at the age of 94.","url":"https://www.cbsnews.com/video/comedy-icon-bob-newhart-dies-at-94/","publishedAt":"2024-07-18T23:44:00Z","SourceName":"cbsnews"},{"title":"Secret Service admits some security modifications for Trump \"not provided\" before rally","description":"The Trump campaign has said it asked for extra security and was denied.","url":"https://www.cbsnews.com/news/secret-service-trump-shooting-security-modifications/","publishedAt":"2024-07-22T05:19:12Z","SourceName":"cbsnews"},{"title":"Biden's decision to drop out upends presidential race","description":"President Biden announced Sunday he is dropping his reelection bid in the 2024 presidential race and endorsing Vice President Kamala Harris.","url":"https://www.cbsnews.com/live-updates/biden-drops-out-2024-presidential-race/","publishedAt":"2024-07-22T03:56:00Z","SourceName":"cbsnews"},{"title":"President Joe Biden on 60 Minutes through the years | 60 Minutes Full Episodes","description":"From 2023, Scott Pelley's interview with President Biden, days after the October 7th attack in Israel. From 2022, Pelley's talk with Biden about the war in Ukraine and that year's midterm elections. From 2020, Norah O'Donnell's interview with then-candidate Biden and his running mate Kamala Harris. From 2019, O'Donnell's chat with candidate Biden during his primary campaign. From 2015, O'Donnell's interview with then-Vice President Biden about his decision not to run in the 2016 election. From 2009, Lesley Stahl's sit-down with Biden about his and President Obama's first 100 days in office. And from 2008, Steve Kroft's look at the Obama-Biden ticket.","url":"https://www.cbsnews.com/video/president-joe-biden-on-60-minutes-through-the-years-60-minutes-full-episodes/","publishedAt":"2024-07-22T02:50:04Z","SourceName":"cbsnews"},{"title":"7/21: The Takeout: Major heads to Milwaukee","description":"On this edition of 'The Takeout,\" Major Garrett heads to Milwaukee to cover the 2024 Republican National Convention. His  guests include former presidential candidate Vivek Ramaswamy, Georgia Gov. Brian Kemp, Milwaukee County Executive David Crowley, and former Wisconsin Gov. Scott Walker.","url":"https://www.cbsnews.com/video/721-the-takeout-major-heads-to-milwaukee/","publishedAt":"2024-07-22T02:31:03Z","SourceName":"cbsnews"},{"title":"Arizona voters react to Biden dropping out, Kamala Harris seeking Democratic nomination","description":"Voters in Arizona reacted Sunday to President Biden's decision to end his reelection campaign and endorse Vice President Kamala Harris for the Democratic nomination. CBS News producer Elizabeth Campbell has more from Arizona, and Democratic strategist Joel Payne joins with analysis.","url":"https://www.cbsnews.com/video/arizona-voters-react-to-biden-dropping-out-kamala-harris-2024-election/","publishedAt":"2024-07-22T02:08:00Z","SourceName":"cbsnews"},{"title":"How Kamala Harris is received on campaign trail","description":"CBS News campaign reporter Nidia Cavazos has been following Vice President Kamala Harris throughout the 2024 campaign season. Cavazos has more on how voters have responded to Harris at her events.","url":"https://www.cbsnews.com/video/how-kamala-harris-is-received-on-campaign-trail/","publishedAt":"2024-07-22T01:52:00Z","SourceName":"cbsnews"},{"title":"Biden drops reelection bid, upending 2024 race","description":"President Biden ended his reelection campaign Sunday, less than four months before Election Day. Democrats now face an unprecedented process to replace him on the party's ticket. CBS News' John Dickerson, Willie James Inman, Nancy Cordes, Nikole Killion and Margaret Brennan report on Biden's historic decision.","url":"https://www.cbsnews.com/video/biden-drops-reelection-bid-upending-2024-race/","publishedAt":"2024-07-22T01:52:00Z","SourceName":"cbsnews"},{"title":"Could Joe Manchin or others challenge Harris for Democratic nomination?","description":"Vice President Kamala Harris has received a barrage of endorsements following President Biden's announcement that he would end his reelection campaign, but she's not necessarily a lock for the Democratic nomination for president. CBS News congressional correspondent Scott MacFarlane has more.","url":"https://www.cbsnews.com/video/could-joe-manchin-or-others-challenge-harris-for-democratic-nomination/","publishedAt":"2024-07-22T01:46:00Z","SourceName":"cbsnews"},{"title":"President Biden bows out of 2024 race in historic decision","description":"President Biden announced Sunday that he is no longer running for reelection in 2024. Nancy Cordes has the latest on the historic decision.","url":"https://www.cbsnews.com/video/president-biden-bows-out-of-2024-race-in-historic-decision/","publishedAt":"2024-07-22T01:45:00Z","SourceName":"cbsnews"},{"title":"Who could be the Democratic running mate?","description":"While it's not a guarantee Vice President Kamala Harris will grab the Democratic nomination after President Biden's withdrawal, she quickly earned key endorsements, including from the president. Weijia Jiang looks at some of the likely contenders Harris could pick as her running mate.","url":"https://www.cbsnews.com/video/who-could-be-the-democratic-running-mate/","publishedAt":"2024-07-22T01:38:00Z","SourceName":"cbsnews"},{"title":"What happens now that Biden has dropped out?","description":"President Biden's announcement that he is dropping out of the 2024 presidential race leaves several questions unanswered about the state of the election. Robert Costa and Margaret Brennan explain what will happen moving forward.","url":"https://www.cbsnews.com/video/what-happens-now-that-biden-has-dropped-out/","publishedAt":"2024-07-22T01:38:00Z","SourceName":"cbsnews"},{"title":"The historic implications of Biden's decision to end reelection campaign","description":"Presidential historian Douglas Brinkley joined CBS News to discuss how history might remember President Biden's decision to end his 2024 campaign and what kind of precedent there is for the move Biden and the Democrats are embarking on.","url":"https://www.cbsnews.com/video/the-historic-implications-of-bidens-decision/","publishedAt":"2024-07-22T01:38:00Z","SourceName":"cbsnews"},{"title":"World leaders react to Biden exiting 2024 presidential race","description":"President Biden's announcement to end his reelection campaign Sunday drew reactions from leaders around the world. CBS News' Ian Lee has more.","url":"https://www.cbsnews.com/video/world-leaders-react-biden-exiting-2024-presidential-race/","publishedAt":"2024-07-22T01:37:00Z","SourceName":"cbsnews"},{"title":"How Trump campaign is shifting its strategy with Biden out of race","description":"Former President Donald Trump's campaign and the Republican Party will have to shift their strategy after President Biden's historic decision to exist the presidential race. CBS News political correspondent Caitlin Huey-Burns has more on the GOP strategy and Democratic strategist Chuck Rocha discusses what's next for the Democratic Party.","url":"https://www.cbsnews.com/video/how-trump-campaign-shifting-strategy-with-biden-out-of-race/","publishedAt":"2024-07-22T01:32:00Z","SourceName":"cbsnews"},{"title":"Voters react to Biden dropping out, Harris says she doesn't want a coronation","description":"Reactions are coming out in Washington, D.C., and across the country Sunday to President Biden's announcement that he is ending his reelection campaign and endorsing Vice President Kamala Harris to replace him on the 2024 Democratic ticket. CBS News political director Fin Gomez has more.","url":"https://www.cbsnews.com/video/voters-react-to-biden-dropping-out-harris-says-she-doesnt-want-a-coronation/","publishedAt":"2024-07-22T01:31:00Z","SourceName":"cbsnews"},{"title":"How voters are reacting to Biden dropping out","description":"President Biden's announcement he would withdraw from the 2024 race came amid slipping poll numbers. Jim Axelrod takes a look at how voters are reacting to the decision.","url":"https://www.cbsnews.com/video/how-voters-are-reacting-to-biden-dropping-out/","publishedAt":"2024-07-22T01:23:00Z","SourceName":"cbsnews"},{"title":"Trump likely to portray Democrats as party in disarray after Biden drops out","description":"Former President Donald Trump is still reacting to Sunday's news that President Biden is ending his 2024 campaign and endorsing Vice President Kamala Harris for the Oval Office. CBS News national correspondent Manuel Bojorquez has more on what Trump has been saying on social media and what his campaign strategy could be moving forward.","url":"https://www.cbsnews.com/video/trump-likely-to-portray-democrats-as-party-in-disarray-after-biden-drops-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"Examining the fallout of Biden dropping out","description":"President Biden announcing he is dropping out of the 2024 race just weeks before the Democratic National Convention in Chicago could lead to a messy convention. CBS News contributor and former senior advisor to Mr. Biden and Vice President Kamala Harris Ashley Etienne and Republican political strategist Terry Sullivan discuss what may happen in the coming weeks.","url":"https://www.cbsnews.com/video/examining-the-fallout-of-biden-dropping-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"John Dickerson on Biden dropping out","description":"John Dickerson joins \"CBS Evening News\" to examine what comes next now that President Biden has dropped out of the 2024 race.","url":"https://www.cbsnews.com/video/john-dickerson-on-biden-dropping-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"Rep. Jamie Raskin on Biden dropping out","description":"Rep. Jamie Raskin was one of the key Democratic lawmakers calling on President Biden to drop out of the 2024 race. He joined the \"CBS Evening News\" to discuss his reaction to Mr. Biden's announcement and what he would like to see moving forward.","url":"https://www.cbsnews.com/video/rep-jamie-raskin-on-biden-dropping-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"A look at Biden's legacy after he dropped out of 2024 race","description":"President Biden's announcement at age 81 that he will drop out of the 2024 race all but assures he will be a one-term president. Major Garrett takes a look at Mr. Biden's legacy and how the decision to bow out of the race affects it.","url":"https://www.cbsnews.com/video/a-look-at-bidens-legacy-after-he-dropped-out-of-2024-race/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"How Biden decided to drop out of 2024 race","description":"President Biden made the decision to drop out of the 2024 race while dealing with a COVID-19 infection at his vacation home in Rehoboth, Delaware. Willie Inman has the details on why Mr. Biden decided to withdraw from the race.","url":"https://www.cbsnews.com/video/how-biden-decided-to-drop-out-of-2024-race/","publishedAt":"2024-07-22T01:20:00Z","SourceName":"cbsnews"},{"title":"President Biden drops out of 2024 race after weeks of pressure","description":"President Biden announced Sunday he was dropping out of the 2024 presidential race and endorsing Vice President Kamala Harris to lead the Democratic ticket. Nancy Cordes has the latest.","url":"https://www.cbsnews.com/video/president-biden-drops-out-of-2024-race-after-weeks-of-pressure/","publishedAt":"2024-07-22T01:17:00Z","SourceName":"cbsnews"},{"title":"Trump campaign has been prepared for switch in the Democratic ticket since debate, adviser says","description":"Danielle Alvarez, a senior adviser for the Trump campaign, says they \"have been prepared for Kamala Harris or any sort of switch in the ticket\" since the June debate between President Biden and former President Donald Trump. Alvarez joins CBS News with her reaction to Biden's withdrawal from the 2024 presidential election.","url":"https://www.cbsnews.com/video/trump-campaign-adviser-prepared-kamala-harris-switch-in-ticket-debate/","publishedAt":"2024-07-22T01:16:00Z","SourceName":"cbsnews"},{"title":"How Democratic, Republican lawmakers are reacting to Biden dropping out of 2024 race","description":"As Democratic lawmakers praise President Biden following his decision to end his reelection bid, some Republicans are calling for him to resign from the presidency. CBS News congressional correspondent Nikole Killion has more on reactions from Capitol Hill.","url":"https://www.cbsnews.com/video/how-democratic-republican-lawmakers-are-reacting-to-biden-dropping-out-of-2024-race/","publishedAt":"2024-07-22T01:15:00Z","SourceName":"cbsnews"},{"title":"\"CBS Evening News\" headlines for Sunday, July 21, 2024","description":"Here's a look at the top stories making headlines on the \"CBS Evening News with Norah O'Donnell.\"","url":"https://www.cbsnews.com/video/cbs-evening-news-headlines-for-sunday-july-21-2024/","publishedAt":"2024-07-22T01:12:00Z","SourceName":"cbsnews"},{"title":"Crime victims form unlikely bonds with wrongfully convicted men","description":"A rape survivor, guilt ridden after learning that an innocent man had been sent to prison in her case, brings together crime victims and exonerees to help heal those impacted by wrongful convictions.","url":"https://www.cbsnews.com/news/crime-victims-form-unlikely-bonds-with-wrongfully-convicted-60-minutes-transcript/","publishedAt":"2024-07-22T01:06:00Z","SourceName":"cbsnews"},{"title":"Bridging America's political divide with conversations","description":"A program from the creator of the oral history project \"StoryCorps\" is asking Americans with opposing political ideals to do the seemingly impossible: talk with each other. Norah O'Donnell reports.","url":"https://www.cbsnews.com/news/one-small-step-storycorps-60-minutes-transcript/","publishedAt":"2024-07-22T01:06:00Z","SourceName":"cbsnews"},{"title":"Capturing the emotional journey of Healing Justice","description":"Lesley Stahl and 60 Minutes producer Shari Finkelstein took a unique approach to their story, capturing the raw emotions of crime victims and wrongfully convicted men during a three-day retreat.","url":"https://www.cbsnews.com/news/capturing-the-emotional-journey-of-healing-justice-60-minutes/","publishedAt":"2024-07-22T01:06:00Z","SourceName":"cbsnews"},{"title":"Love, loss, and life; the StoryCorps session Jason Reynolds never forgot","description":"More than 15 years after meeting Gary Lakin and Allison Oleszkowicz, best-selling author Jason Reynolds recalls their story of tragedy and joy.","url":"https://www.cbsnews.com/news/storycorps-jason-reynolds-60-minutes/","publishedAt":"2024-07-22T01:06:00Z","SourceName":"cbsnews"}]
