[{"title":"Secret Service director on Capitol Hill following Trump assassination attempt","description":"Secret Service Director Kimberly Cheatle faced calls to resign Monday during a contentious hearing following the attempted assassination of Republican presidential nominee and former President Donald Trump. Scott MacFarlane has more.","url":"https://www.cbsnews.com/video/secret-service-director-on-capitol-hill-following-trump-assassination-attempt/","publishedAt":"2024-07-22T23:27:00Z","SourceName":"cbsnews"},{"title":"Illinois deputy charged with murder in shooting of Sonya Massey","description":"Bodycam video of the killing of Sonya Massey, a Black woman who sought the help of authorities, was released Monday. The deputy who shot the woman has been charged with three counts of murder. Roxana Saberi has the details.","url":"https://www.cbsnews.com/video/illinois-deputy-charged-with-murder-in-shooting-of-sonya-massey/","publishedAt":"2024-07-22T23:27:00Z","SourceName":"cbsnews"},{"title":"How President Biden's camp is reacting to the end of the campaign, plus Republican's reaction","description":"Biden aides have some bitterness about how the president's campaign ended and Republicans are saying he's unfit to stay in office. Ed O'Keefe has more details.","url":"https://www.cbsnews.com/video/how-president-bidens-camp-is-reacting-to-the-end-of-the-campaign-plus-republicans-reaction/","publishedAt":"2024-07-22T23:26:00Z","SourceName":"cbsnews"},{"title":"Who could Vice President Kamala Harris choose as her running mate?","description":"Vice President Harris will have to make a decision soon over who to add on her ticket for a Democratic campaign. Robert Costa has analysis on who she could choose.","url":"https://www.cbsnews.com/video/who-could-vice-president-kamala-harris-choose-as-her-running-mate/","publishedAt":"2024-07-22T23:25:00Z","SourceName":"cbsnews"},{"title":"Support for Vice President Kamala Harris' campaign growing","description":"A slew of endorsements and a significant amount of campaign donations have come into Vice President Kamala Harris' campaign one full day after President Biden said he would not be running for re-election. Weijia Jiang has more.","url":"https://www.cbsnews.com/video/support-for-vice-president-kamala-harris-campaign-growing/","publishedAt":"2024-07-22T23:24:00Z","SourceName":"cbsnews"},{"title":"\"CBS Evening News\" headlines for Monday, July 22, 2024","description":"Here's a look at the top stories making headlines on the \"CBS Evening News with Norah O'Donnell.\"","url":"https://www.cbsnews.com/video/cbs-evening-news-headlines-for-monday-july-22-2024/","publishedAt":"2024-07-22T23:20:00Z","SourceName":"cbsnews"},{"title":"Jeep and Ram vehicles under investigation by feds","description":"Federal safety regulators are looking into complaints that some Ram pickups and Jeep Wagoneer SUVs can lose power, shift into park and apply the emergency brake.","url":"https://www.cbsnews.com/news/jeep-wagoneer-ram-pickups-stellantis-fed-investigation-2024/","publishedAt":"2024-07-22T23:07:58Z","SourceName":"cbsnews"},{"title":"Missouri judge overturns wrongful conviction of Christopher Dunn","description":"A Missouri judge on Monday overturned the conviction of Christopher Dunn, who has spent more than 30 years in prison for a killing he has long contended he didn't commit.​","url":"https://www.cbsnews.com/news/christopher-dunn-missouri-judge-overturns-murder-conviction/","publishedAt":"2024-07-22T22:30:58Z","SourceName":"cbsnews"},{"title":"Biden calls into Harris campaign event in 1st remarks since exiting race","description":"President Biden called in Monday to speak with Harris campaign staffers in Delaware. They were his first public remarks since dropping out of the 2024 presidential race. CBS News senior White House and political correspondent Ed O'Keefe reports.","url":"https://www.cbsnews.com/video/biden-calls-into-harris-campaign-event/","publishedAt":"2024-07-22T22:27:00Z","SourceName":"cbsnews"},{"title":"Harris' bid for president draws growing support after Biden drops out","description":"President Biden announced Sunday he is dropping his reelection bid in the 2024 presidential race and endorsing Vice President Kamala Harris.","url":"https://www.cbsnews.com/live-updates/biden-drops-out-2024-presidential-race/","publishedAt":"2024-07-22T22:26:00Z","SourceName":"cbsnews"},{"title":"\"The Simpsons\" writer comments on Kamala Harris predictions: \"I'm proud\"","description":"In \"Bart to the Future,\" Lisa Simpson replaces Donald Trump as president, wearing an outfit that is eerily similar to Kamala Harris' inauguration suit.","url":"https://www.cbsnews.com/news/the-simpsons-kamala-harris-suit-prediction-al-jean/","publishedAt":"2024-07-22T21:47:27Z","SourceName":"cbsnews"},{"title":"Google reneges on plan to remove third-party cookies in Chrome","description":"Google said it won't phase out third-party cookies in its Chrome browser after all, opting to let people \"make an informed choice.\"","url":"https://www.cbsnews.com/news/google-third-party-cookies-chrome/","publishedAt":"2024-07-22T21:45:48Z","SourceName":"cbsnews"},{"title":"Poll: Many Democrats back Harris, feel election chances improved after Biden exit","description":"Many Democrats believe Biden's exit from the campaign will improve chances of beating Trump in November.","url":"https://www.cbsnews.com/news/kamala-harris-president-democrats-opinion-poll-07-22-2024/","publishedAt":"2024-07-22T21:32:29Z","SourceName":"cbsnews"},{"title":"Officials release video of officer fatally shooting Sonya Massey in her home after she called 911","description":"Bodycam video of the fatal shooting of Sonya Massey was released Monday afternoon. The video shows the chaotic scene after a sheriff's deputy shot Massey, who is Black, in the face during a tense moment over a pot of water in her home.","url":"https://www.cbsnews.com/news/sonya-massey-bodycam-footage-illinois-911-fatal-police-shooting/","publishedAt":"2024-07-22T20:34:00Z","SourceName":"cbsnews"},{"title":"Calls grow for Maya Rudolph to reprise Kamala Harris on \"SNL\"","description":"Maya Rudolph played Harris several times as a guest on \"SNL\" in 2019, during the 2020 presidential election cycle.","url":"https://www.cbsnews.com/news/maya-rudolph-kamala-harris-saturday-night-live/","publishedAt":"2024-07-22T20:32:22Z","SourceName":"cbsnews"},{"title":"Harris in Delaware as campaign earns key endorsements, donations","description":"Vice President Kamala Harris is in Wilmington, Delaware, where she will address workers at President Biden's campaign headquarters Monday. This comes as endorsements and donations trickle in for Harris after Mr. Biden's announcement that he would be dropping out of the 2024 presidential race. Senior White House correspondent Weijia Jiang reports.","url":"https://www.cbsnews.com/video/harris-in-delaware-as-campaign-earns-key-endorsements-donations/","publishedAt":"2024-07-22T20:32:00Z","SourceName":"cbsnews"},{"title":"Harris campaign raised $81 million in 24 hours after Biden dropped out","description":"Vice President Kamala Harris' presidential campaign said the $81 million raised is record-breaking.","url":"https://www.cbsnews.com/news/kamala-harris-fundraising-81-million-biden-drops-out/","publishedAt":"2024-07-22T20:14:49Z","SourceName":"cbsnews"},{"title":"Who could Kamala Harris pick as her VP? Here are 10 potential running mates","description":"Vice President Kamala Harris will have to choose a running mate soon.","url":"https://www.cbsnews.com/news/kamala-harris-vice-president-candidates/","publishedAt":"2024-07-22T20:14:00Z","SourceName":"cbsnews"},{"title":"Secret Service director grilled over Trump assassination attempt","description":"Secret Service Director Kimberly Cheatle testified before the House Oversight Committee Monday on her agency's failure to secure the space where former President Donald Trump was targeted by an armed man during a campaign rally in Pennsylvania. CBS News congressional correspondent Scott MacFarlane has more on the ongoing investigations into the assassination attempt.","url":"https://www.cbsnews.com/video/secret-service-director-grilled-over-trump-assassination-attempt/","publishedAt":"2024-07-22T20:13:00Z","SourceName":"cbsnews"},{"title":"3 big reasons to pursue credit card debt forgiveness this August","description":"Settling your credit card debt could be a wise move in today's high-rate environment. Here's why.","url":"https://www.cbsnews.com/news/big-reasons-to-pursue-credit-card-debt-forgiveness-this-august/","publishedAt":"2024-07-22T20:10:30Z","SourceName":"cbsnews"},{"title":"Who could Harris consider for 2024 campaign VP pick?","description":"Kentucky Gov. Andy Beshear, Michigan Gov. Gretchen Whitmer and Arizona Sen. Mark Kelly are among the names being floated as potential running mate picks for Vice President Kamala Harris' 2024 campaign. Chuck Rocha, a Democratic party strategist, and Kevin Sheridan, a Republican party strategist, join CBS News with a look at Harris' potential VP considerations.","url":"https://www.cbsnews.com/video/who-could-harris-consider-for-2024-campaign-vp-pick/","publishedAt":"2024-07-22T19:59:00Z","SourceName":"cbsnews"},{"title":"Gold prices keep rising. Here's how to take advantage now.","description":"The price of gold just hit another record high. Here are three things investors should do now.","url":"https://www.cbsnews.com/news/gold-prices-keep-rising-how-to-take-advantage-now/","publishedAt":"2024-07-22T19:50:04Z","SourceName":"cbsnews"},{"title":"This state was named the best place to retire in the U.S.","description":"These are the best and worst states to retire in the U.S., based on key metrics like affordability and access to quality health care.","url":"https://www.cbsnews.com/news/best-state-to-retire-in-the-us/","publishedAt":"2024-07-22T19:44:37Z","SourceName":"cbsnews"},{"title":"Aubrey Plaza tore her ACL before attending the WNBA All-Star game","description":"Actor Aubrey Plaza suffered a torn ACL before attending the anticipated WNBA All-Star game in Phoenix over the weekend, a commentator said.","url":"https://www.cbsnews.com/news/aubrey-plaza-tore-acl-wnba-all-star-game/","publishedAt":"2024-07-22T19:42:00Z","SourceName":"cbsnews"},{"title":"What Harris' platform may look like for 2024 presidential race","description":"Vice President Kamala Harris' platform for the 2024 presidential race may not differ much from President Biden's main running points, but it may reflect differing takes on some of the country's top issues, such as women's reproductive rights and the Israel-Hamas war. CBS News chief White House correspondent Nancy Cordes reports.","url":"https://www.cbsnews.com/video/what-harris-platform-may-look-like-for-2024-presidential-race/","publishedAt":"2024-07-22T19:33:00Z","SourceName":"cbsnews"},{"title":"Joe Biden's legacy after historic decision to give up 2024 reelection campaign","description":"A look at President Biden's legacy after he became the first presumptive nominee to give up the nomination at this point in the campaign.","url":"https://www.cbsnews.com/news/biden-legacy-president/","publishedAt":"2024-07-22T19:25:00Z","SourceName":"cbsnews"},{"title":"The best laptop deals to shop in July","description":"Shop deals on laptops that'll save you hundreds on popular brands like Asus, Acer, Razer and more.","url":"https://www.cbsnews.com/essentials/best-laptop-deals/","publishedAt":"2024-07-22T19:23:00Z","SourceName":"cbsnews"},{"title":"The 5 best portable monitors for laptops in 2024","description":"Discover some of the best portable monitors that can be used with your MacBook or Windows laptop computer.","url":"https://www.cbsnews.com/essentials/best-portable-monitors/","publishedAt":"2024-07-22T19:15:00Z","SourceName":"cbsnews"},{"title":"The 6 best all-in-one printers for 2024 are must-haves for students","description":"Print, copy, scan and even fax with these feature-rich printers that can really make a difference in the fall.","url":"https://www.cbsnews.com/essentials/best-all-in-one-printers/","publishedAt":"2024-07-22T19:08:14Z","SourceName":"cbsnews"},{"title":"Secret Service director faces fierce grilling at first hearing on Trump shooting","description":"Secret Service Director Kimberly Cheatle repeatedly refused to answer questions about the attempted assassination of former President Donald Trump, enraging lawmakers.","url":"https://www.cbsnews.com/live-updates/secret-service-hearing-trump-shooting-kimberly-cheatle/","publishedAt":"2024-07-22T18:45:00Z","SourceName":"cbsnews"},{"title":"Samsung Galaxy Z Fold6 review: Perfect for back-to-school","description":"Discover the features and functions added to the Samsung Galaxy Z Fold6 and why it's a great phone for power users.","url":"https://www.cbsnews.com/news/samsung-galaxy-z-fold6-review/","publishedAt":"2024-07-23T00:33:00Z","SourceName":"cbsnews"},{"title":"President Biden's departure from the race evokes memories of 1968","description":"News over the weekend that President Biden would not seek re-election brings to mind 1968, when Lyndon B. Johnson decided not to seek re-election. Mark Strassman talks to a historian over the other similarities between now and the campaign of 1968.","url":"https://www.cbsnews.com/video/president-bidens-departure-from-the-race-evokes-memories-of-1968/","publishedAt":"2024-07-22T23:49:00Z","SourceName":"cbsnews"},{"title":"Delta Airlines struggling to recover after Crowdstrike outage","description":"Delta's CEO told employees on Monday that it will be days before things are back to normal following last week's global tech problems. Kris Van Cleave has more.","url":"https://www.cbsnews.com/video/delta-airlines-struggling-to-recover-after-crowdstrike-outage/","publishedAt":"2024-07-22T23:48:00Z","SourceName":"cbsnews"},{"title":"Kamala Harris lays out platform in speech to campaign staffers","description":"Vice President Kamala Harris spoke in Wilmington, Delaware, Monday after meeting with campaign staffers. Harris laid out the vision for her presidency should she win in November. Molly Ball, senior political correspondent at The Wall Street Journal, joins CBS News with analysis.","url":"https://www.cbsnews.com/video/kamala-harris-lays-out-platform-in-speech-to-campaign-staffers/","publishedAt":"2024-07-22T23:30:00Z","SourceName":"cbsnews"}]
