[{"title":"Biden's decision to drop out upends presidential race","description":"President Biden announced Sunday he is dropping his reelection bid in the 2024 presidential race and endorsing Vice President Kamala Harris.","url":"https://www.cbsnews.com/live-updates/biden-drops-out-2024-presidential-race/","publishedAt":"2024-07-22T12:04:00Z","SourceName":"cbsnews"},{"title":"Pilot living \"her dream\" killed in crash after releasing skydivers","description":"Melanie Georger was working to become a commercial pilot, her father said Saturday in a statement on Facebook.","url":"https://www.cbsnews.com/news/pilot-dies-crash-after-releasing-skydivers-niagara-falls-identified-melanie-georger/","publishedAt":"2024-07-22T12:02:44Z","SourceName":"cbsnews"},{"title":"Israel's Netanyahu heads to D.C. after Biden exits presidential race","description":"Israeli leader Benjamin Netanyahu heads for Washington under pressure over the Gaza war and amid huge U.S. political uncertainty.","url":"https://www.cbsnews.com/news/israel-netanyahu-washington-visit-biden-congress-amid-war-with-hamas/","publishedAt":"2024-07-22T11:44:46Z","SourceName":"cbsnews"},{"title":"7/21: The Takeout: Major heads to Milwaukee","description":"On this edition of 'The Takeout,\" Major Garrett heads to Milwaukee to cover the 2024 Republican National Convention. His  guests include former presidential candidate Vivek Ramaswamy, Georgia Gov. Brian Kemp, Milwaukee County Executive David Crowley, and former Wisconsin Gov. Scott Walker.","url":"https://www.cbsnews.com/video/721-the-takeout-major-heads-to-milwaukee/","publishedAt":"2024-07-22T11:13:51Z","SourceName":"cbsnews"},{"title":"Girl accused of smothering 8-year-old cousin to death over iPhone","description":"A security camera recorded the killing, inside the bedroom they shared in Humboldt, Tennessee, the county prosecutor said.","url":"https://www.cbsnews.com/news/tennessee-girl-smothers-8-year-old-cousin-over-iphone-charged-murder/","publishedAt":"2024-07-22T10:53:22Z","SourceName":"cbsnews"},{"title":"Police chief shot dead days after activist, wife and daughter killed in Mexico","description":"The murders marked the latest in a series of attacks targeting police, activists and politicians across Mexico.","url":"https://www.cbsnews.com/news/police-chief-killed-mexico-city-indigenous-activist-wife-daughter-killed-oaxaca/","publishedAt":"2024-07-22T10:44:41Z","SourceName":"cbsnews"},{"title":"Secret Service admits some security modifications for Trump \"not provided\" before rally","description":"The Trump campaign has said it asked for extra security and was denied.","url":"https://www.cbsnews.com/news/secret-service-trump-shooting-security-modifications/","publishedAt":"2024-07-22T05:19:12Z","SourceName":"cbsnews"},{"title":"President Joe Biden on 60 Minutes through the years | 60 Minutes Full Episodes","description":"From 2023, Scott Pelley's interview with President Biden, days after the October 7th attack in Israel. From 2022, Pelley's talk with Biden about the war in Ukraine and that year's midterm elections. From 2020, Norah O'Donnell's interview with then-candidate Biden and his running mate Kamala Harris. From 2019, O'Donnell's chat with candidate Biden during his primary campaign. From 2015, O'Donnell's interview with then-Vice President Biden about his decision not to run in the 2016 election. From 2009, Lesley Stahl's sit-down with Biden about his and President Obama's first 100 days in office. And from 2008, Steve Kroft's look at the Obama-Biden ticket.","url":"https://www.cbsnews.com/video/president-joe-biden-on-60-minutes-through-the-years-60-minutes-full-episodes/","publishedAt":"2024-07-22T02:50:04Z","SourceName":"cbsnews"},{"title":"Arizona voters react to Biden dropping out, Kamala Harris seeking Democratic nomination","description":"Voters in Arizona reacted Sunday to President Biden's decision to end his reelection campaign and endorse Vice President Kamala Harris for the Democratic nomination. CBS News producer Elizabeth Campbell has more from Arizona, and Democratic strategist Joel Payne joins with analysis.","url":"https://www.cbsnews.com/video/arizona-voters-react-to-biden-dropping-out-kamala-harris-2024-election/","publishedAt":"2024-07-22T02:08:00Z","SourceName":"cbsnews"},{"title":"How Kamala Harris is received on campaign trail","description":"CBS News campaign reporter Nidia Cavazos has been following Vice President Kamala Harris throughout the 2024 campaign season. Cavazos has more on how voters have responded to Harris at her events.","url":"https://www.cbsnews.com/video/how-kamala-harris-is-received-on-campaign-trail/","publishedAt":"2024-07-22T01:52:00Z","SourceName":"cbsnews"},{"title":"Biden drops reelection bid, upending 2024 race","description":"President Biden ended his reelection campaign Sunday, less than four months before Election Day. Democrats now face an unprecedented process to replace him on the party's ticket. CBS News' John Dickerson, Willie James Inman, Nancy Cordes, Nikole Killion and Margaret Brennan report on Biden's historic decision.","url":"https://www.cbsnews.com/video/biden-drops-reelection-bid-upending-2024-race/","publishedAt":"2024-07-22T01:52:00Z","SourceName":"cbsnews"},{"title":"Could Joe Manchin or others challenge Harris for Democratic nomination?","description":"Vice President Kamala Harris has received a barrage of endorsements following President Biden's announcement that he would end his reelection campaign, but she's not necessarily a lock for the Democratic nomination for president. CBS News congressional correspondent Scott MacFarlane has more.","url":"https://www.cbsnews.com/video/could-joe-manchin-or-others-challenge-harris-for-democratic-nomination/","publishedAt":"2024-07-22T01:46:00Z","SourceName":"cbsnews"},{"title":"President Biden bows out of 2024 race in historic decision","description":"President Biden announced Sunday that he is no longer running for reelection in 2024. Nancy Cordes has the latest on the historic decision.","url":"https://www.cbsnews.com/video/president-biden-bows-out-of-2024-race-in-historic-decision/","publishedAt":"2024-07-22T01:45:00Z","SourceName":"cbsnews"},{"title":"Who could be the Democratic running mate?","description":"While it's not a guarantee Vice President Kamala Harris will grab the Democratic nomination after President Biden's withdrawal, she quickly earned key endorsements, including from the president. Weijia Jiang looks at some of the likely contenders Harris could pick as her running mate.","url":"https://www.cbsnews.com/video/who-could-be-the-democratic-running-mate/","publishedAt":"2024-07-22T01:38:00Z","SourceName":"cbsnews"},{"title":"The historic implications of Biden's decision to end reelection campaign","description":"Presidential historian Douglas Brinkley joined CBS News to discuss how history might remember President Biden's decision to end his 2024 campaign and what kind of precedent there is for the move Biden and the Democrats are embarking on.","url":"https://www.cbsnews.com/video/the-historic-implications-of-bidens-decision/","publishedAt":"2024-07-22T01:38:00Z","SourceName":"cbsnews"},{"title":"What happens now that Biden has dropped out?","description":"President Biden's announcement that he is dropping out of the 2024 presidential race leaves several questions unanswered about the state of the election. Robert Costa and Margaret Brennan explain what will happen moving forward.","url":"https://www.cbsnews.com/video/what-happens-now-that-biden-has-dropped-out/","publishedAt":"2024-07-22T01:38:00Z","SourceName":"cbsnews"},{"title":"World leaders react to Biden exiting 2024 presidential race","description":"President Biden's announcement to end his reelection campaign Sunday drew reactions from leaders around the world. CBS News' Ian Lee has more.","url":"https://www.cbsnews.com/video/world-leaders-react-biden-exiting-2024-presidential-race/","publishedAt":"2024-07-22T01:37:00Z","SourceName":"cbsnews"},{"title":"How Trump campaign is shifting its strategy with Biden out of race","description":"Former President Donald Trump's campaign and the Republican Party will have to shift their strategy after President Biden's historic decision to exist the presidential race. CBS News political correspondent Caitlin Huey-Burns has more on the GOP strategy and Democratic strategist Chuck Rocha discusses what's next for the Democratic Party.","url":"https://www.cbsnews.com/video/how-trump-campaign-shifting-strategy-with-biden-out-of-race/","publishedAt":"2024-07-22T01:32:00Z","SourceName":"cbsnews"},{"title":"Voters react to Biden dropping out, Harris says she doesn't want a coronation","description":"Reactions are coming out in Washington, D.C., and across the country Sunday to President Biden's announcement that he is ending his reelection campaign and endorsing Vice President Kamala Harris to replace him on the 2024 Democratic ticket. CBS News political director Fin Gomez has more.","url":"https://www.cbsnews.com/video/voters-react-to-biden-dropping-out-harris-says-she-doesnt-want-a-coronation/","publishedAt":"2024-07-22T01:31:00Z","SourceName":"cbsnews"},{"title":"How voters are reacting to Biden dropping out","description":"President Biden's announcement he would withdraw from the 2024 race came amid slipping poll numbers. Jim Axelrod takes a look at how voters are reacting to the decision.","url":"https://www.cbsnews.com/video/how-voters-are-reacting-to-biden-dropping-out/","publishedAt":"2024-07-22T01:23:00Z","SourceName":"cbsnews"},{"title":"Trump likely to portray Democrats as party in disarray after Biden drops out","description":"Former President Donald Trump is still reacting to Sunday's news that President Biden is ending his 2024 campaign and endorsing Vice President Kamala Harris for the Oval Office. CBS News national correspondent Manuel Bojorquez has more on what Trump has been saying on social media and what his campaign strategy could be moving forward.","url":"https://www.cbsnews.com/video/trump-likely-to-portray-democrats-as-party-in-disarray-after-biden-drops-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"Examining the fallout of Biden dropping out","description":"President Biden announcing he is dropping out of the 2024 race just weeks before the Democratic National Convention in Chicago could lead to a messy convention. CBS News contributor and former senior advisor to Mr. Biden and Vice President Kamala Harris Ashley Etienne and Republican political strategist Terry Sullivan discuss what may happen in the coming weeks.","url":"https://www.cbsnews.com/video/examining-the-fallout-of-biden-dropping-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"John Dickerson on Biden dropping out","description":"John Dickerson joins \"CBS Evening News\" to examine what comes next now that President Biden has dropped out of the 2024 race.","url":"https://www.cbsnews.com/video/john-dickerson-on-biden-dropping-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"A look at Biden's legacy after he dropped out of 2024 race","description":"President Biden's announcement at age 81 that he will drop out of the 2024 race all but assures he will be a one-term president. Major Garrett takes a look at Mr. Biden's legacy and how the decision to bow out of the race affects it.","url":"https://www.cbsnews.com/video/a-look-at-bidens-legacy-after-he-dropped-out-of-2024-race/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"Rep. Jamie Raskin on Biden dropping out","description":"Rep. Jamie Raskin was one of the key Democratic lawmakers calling on President Biden to drop out of the 2024 race. He joined the \"CBS Evening News\" to discuss his reaction to Mr. Biden's announcement and what he would like to see moving forward.","url":"https://www.cbsnews.com/video/rep-jamie-raskin-on-biden-dropping-out/","publishedAt":"2024-07-22T01:21:00Z","SourceName":"cbsnews"},{"title":"How Biden decided to drop out of 2024 race","description":"President Biden made the decision to drop out of the 2024 race while dealing with a COVID-19 infection at his vacation home in Rehoboth, Delaware. Willie Inman has the details on why Mr. Biden decided to withdraw from the race.","url":"https://www.cbsnews.com/video/how-biden-decided-to-drop-out-of-2024-race/","publishedAt":"2024-07-22T01:20:00Z","SourceName":"cbsnews"},{"title":"President Biden drops out of 2024 race after weeks of pressure","description":"President Biden announced Sunday he was dropping out of the 2024 presidential race and endorsing Vice President Kamala Harris to lead the Democratic ticket. Nancy Cordes has the latest.","url":"https://www.cbsnews.com/video/president-biden-drops-out-of-2024-race-after-weeks-of-pressure/","publishedAt":"2024-07-22T01:17:00Z","SourceName":"cbsnews"},{"title":"Trump campaign has been prepared for switch in the Democratic ticket since debate, adviser says","description":"Danielle Alvarez, a senior adviser for the Trump campaign, says they \"have been prepared for Kamala Harris or any sort of switch in the ticket\" since the June debate between President Biden and former President Donald Trump. Alvarez joins CBS News with her reaction to Biden's withdrawal from the 2024 presidential election.","url":"https://www.cbsnews.com/video/trump-campaign-adviser-prepared-kamala-harris-switch-in-ticket-debate/","publishedAt":"2024-07-22T01:16:00Z","SourceName":"cbsnews"},{"title":"How Democratic, Republican lawmakers are reacting to Biden dropping out of 2024 race","description":"As Democratic lawmakers praise President Biden following his decision to end his reelection bid, some Republicans are calling for him to resign from the presidency. CBS News congressional correspondent Nikole Killion has more on reactions from Capitol Hill.","url":"https://www.cbsnews.com/video/how-democratic-republican-lawmakers-are-reacting-to-biden-dropping-out-of-2024-race/","publishedAt":"2024-07-22T01:15:00Z","SourceName":"cbsnews"},{"title":"\"CBS Evening News\" headlines for Sunday, July 21, 2024","description":"Here's a look at the top stories making headlines on the \"CBS Evening News with Norah O'Donnell.\"","url":"https://www.cbsnews.com/video/cbs-evening-news-headlines-for-sunday-july-21-2024/","publishedAt":"2024-07-22T01:12:00Z","SourceName":"cbsnews"}]
