[{"title":"These are the best gold investing strategies right now, experts say","description":"You may want to utilize various investing strategies, depending on the gold benefits you want to add to your portfolio.","url":"https://www.cbsnews.com/news/these-are-the-best-gold-investing-strategies-right-now-experts-say/","publishedAt":"2024-07-18T15:04:05Z","SourceName":"cbsnews"},{"title":"Canada to quadruple sub fleet as NATO, Russia and China eye the Arctic","description":"Canada plans to buy 12 new submarines as the U.S. and its allies and adversaries step up operations in the thawing Arctic.","url":"https://www.cbsnews.com/news/canada-nato-submarines-arctic-defense-russia-china-northern-sea-route/","publishedAt":"2024-07-18T15:01:00Z","SourceName":"cbsnews"},{"title":"Live Updates: New details in Trump shooting emerge amid investigations","description":"The U.S. Secret Service is facing mounting questions about the security flaws that allowed the shooter to fire from a rooftop near the rally.","url":"https://www.cbsnews.com/live-updates/trump-rally-shooting-investigation/","publishedAt":"2024-07-18T14:41:00Z","SourceName":"cbsnews"},{"title":"Trump shooter's phone had details on Trump and Biden; Senators confront Secret Service director","description":"FBI officials told congressional members Wednesday the gunman who tried to assassinate former President Donald Trump had used his cellphone and other devices to search for images of both Trump and President Biden. Also on Wednesday, GOP senators at the Republican National Convention confronted Secret Service director Kimberly Cheatle, who's now facing calls to resign over the assassination attempt. CBS News' Charlie De Mar and Nikole Killion have more.","url":"https://www.cbsnews.com/video/trump-shooters-phone-had-details-on-trump-and-biden-senators-confront-secret-service-director/","publishedAt":"2024-07-18T14:35:00Z","SourceName":"cbsnews"},{"title":"Exclusive discounts from CBS Mornings Deals","description":"On this edition of CBS Mornings Deals, Adriane Kiss shows us items that might just become essentials in your everyday life. Visit cbsdeals.com to take advantage of these exclusive deals today. CBS earns commissions on purchases made through cbsdeals.com.","url":"https://www.cbsnews.com/video/cbs-mornings-deals-071824/","publishedAt":"2024-07-18T14:29:00Z","SourceName":"cbsnews"},{"title":"Sheryl Lee Ralph talks new film, \"The Fabulous Four,\" and latest Emmy nominations","description":"Emmy award-winning actor Sheryl Lee Ralph joins \"CBS Mornings\" to talk about her new comedy, \"The Fabulous Four,\" and her third Emmy nomination for \"Abbott Elementary.\"","url":"https://www.cbsnews.com/video/sheryl-lee-ralph-talks-new-film-the-fabulous-four-and-latest-emmy-nominations/","publishedAt":"2024-07-18T14:28:00Z","SourceName":"cbsnews"},{"title":"Home security systems and carbon monoxide detection: What to know now","description":"Here's why including carbon monoxide detection in your home security system is so important.","url":"https://www.cbsnews.com/news/home-security-systems-and-carbon-monoxide-detection-what-to-know-now/","publishedAt":"2024-07-18T14:21:36Z","SourceName":"cbsnews"},{"title":"Sheriff's deputy charged in fatal shooting of woman who called 911","description":"Sonya Massey was killed after Sangamon County deputies responded to her 911 call about an intruder early on July 6, officials said.","url":"https://www.cbsnews.com/news/sonya-massey-killed-sangamon-county-deputy-sean-grayson-charged-murder-illinois/","publishedAt":"2024-07-18T14:14:00Z","SourceName":"cbsnews"},{"title":"Recapping the immigration message on Day 3 of RNC","description":"Speakers at Day 3 of the Republican National Convention focused on immigration and border patrol. CBS News' Tony Dokoupil has more on the rhetoric those speakers used in their addresses.","url":"https://www.cbsnews.com/video/recapping-the-immigration-message-on-day-3-of-rnc/","publishedAt":"2024-07-18T14:05:00Z","SourceName":"cbsnews"},{"title":"Content creator dies in fall shooting videos at Indian beauty spot","description":"Indian influencer Aanvi Kamdar was shooting Instagram reels at the popular Kumbhe waterfall when she slipped into a 300-foot deep gorge.","url":"https://www.cbsnews.com/news/aanvi-kamdar-india-instagram-creator-dies-accident-kumbhe-waterfall/","publishedAt":"2024-07-18T14:04:51Z","SourceName":"cbsnews"},{"title":"Lara Trump says Americans may see a \"different version\" of Trump tonight","description":"Former President Donald Trump is set to speak Thursday night at the Republican National Convention.","url":"https://www.cbsnews.com/news/lara-trump-rnc-donald-trump-speech-assassination-attempt/","publishedAt":"2024-07-18T13:58:26Z","SourceName":"cbsnews"},{"title":"Oprah's Book Club: Author David Wroblewski discusses reader's guide for \"Familiaris\"","description":"Oprah Winfrey selected \"Familiaris\" by David Wroblewski as her latest book club selection. Watch as author David Wroblewski answers reader's guide questions about his novel.","url":"https://www.cbsnews.com/video/oprahs-book-club-author-david-wroblewski-discusses-readers-guide-for-familiaris/","publishedAt":"2024-07-18T13:51:00Z","SourceName":"cbsnews"},{"title":"Oprah's Book Club: Author David Wroblewski reads \"Familiaris\" excerpt","description":"Oprah Winfrey selected \"Familiaris\" by David Wroblewski as her latest book club pick. Watch the author, David Wroblewski, read an excerpt from his long-awaited follow-up to his bestselling debut, \"The Story of Edgar Sawtelle.\"","url":"https://www.cbsnews.com/video/oprahs-book-club-author-david-wroblewski-reads-familiaris-excerpt/","publishedAt":"2024-07-18T13:51:00Z","SourceName":"cbsnews"},{"title":"Republicans react to Trump's controversial quotes ahead of RNC speech","description":"As former President Trump prepares for his RNC speech, \"CBS Mornings\" co-host Tony Dokoupil explores the interpretation of some of Trump's most controversial quotes.","url":"https://www.cbsnews.com/video/republicans-react-to-trumps-controversial-quotes-ahead-of-rnc-speech/","publishedAt":"2024-07-18T13:40:00Z","SourceName":"cbsnews"},{"title":"Trump shooter called July 13 his \"premiere\" in online post, sources say","description":"The message, posted on an online gaming platform, was found amid a search for a motive in the shooting of former President Donald Trump.","url":"https://www.cbsnews.com/news/trump-shooter-thomas-matthew-crooks-called-july-13-premiere-online-post-assassination-attempt/","publishedAt":"2024-07-18T13:29:00Z","SourceName":"cbsnews"},{"title":"Seven members of same family killed in suspected arson attack in Nice","description":"Authorities in Nice, southern France, say images show hooded people dousing a stairwell with liquid before a suspected arson fire that killed 7 people.","url":"https://www.cbsnews.com/news/nice-france-fire-kills-7-members-of-same-family-including-3-children/","publishedAt":"2024-07-18T13:26:57Z","SourceName":"cbsnews"},{"title":"Biden reportedly told by Pelosi that he cannot beat Trump","description":"President Biden has reportedly been told privately by former House Speaker Nancy Pelosi that polls show he cannot defeat Donald Trump in November. The reports come as Biden isolates in Delaware due to a case of COVID-19. CBS News White House reporter Willie James Inman has the latest on Biden's campaign and Democratic strategist and CBS News political contributor Joel Payne has analysis of the situation.","url":"https://www.cbsnews.com/video/biden-reportedly-told-by-pelosi-that-he-cannot-beat-trump/","publishedAt":"2024-07-18T13:20:00Z","SourceName":"cbsnews"},{"title":"Lara Trump discusses assassination attempt on Donald Trump, its impact on family and RNC","description":"Former President Donald Trump's daughter-in-law, Lara Trump, discusses the assassination attempt on her father-in-law and how it will impact his speech on the final night of the Republican National Convention.","url":"https://www.cbsnews.com/video/lara-trump-discusses-assassination-attempt-on-donald-trump-its-impact-on-family-and-rnc/","publishedAt":"2024-07-18T13:18:00Z","SourceName":"cbsnews"},{"title":"Analysis of RNC, Biden campaign as more Democrats call for president to step down","description":"CBS News' Senior White House and political correspondent Ed O'Keefe and chief election and campaign correspondent Robert Costa break down what happened at the Republican National Convention and where the Biden campaign stands amid turmoil.","url":"https://www.cbsnews.com/video/analysis-of-rnc-biden-campaign-as-more-democrats-call-for-president-to-step-down/","publishedAt":"2024-07-18T12:58:00Z","SourceName":"cbsnews"},{"title":"Eye Opener: JD Vance makes his first speech as Donald Trump's running mate","description":"Sen. JD Vance makes his first speech as Donald Trump's running mate. Also, President Biden battles COVID and faces new calls from fellow Democrats to step aside in the presidential race  All that and all that matters in today's Eye Opener.","url":"https://www.cbsnews.com/video/eye-opener-jd-vance-makes-his-first-speech-as-donald-trumps-running-mate/","publishedAt":"2024-07-18T12:57:00Z","SourceName":"cbsnews"},{"title":"What to know as Social Security recipients have to update their online accounts","description":"CBS News business analyst Jill Schlesinger explains a change to online Social Security accounts that will impact millions of beneficiaries.","url":"https://www.cbsnews.com/video/what-to-know-as-social-security-recipients-have-to-update-their-online-accounts/","publishedAt":"2024-07-18T12:57:00Z","SourceName":"cbsnews"},{"title":"Ingrid Ciprián-Matthews inducted into NAHJ Hall of Fame","description":"Ingrid Ciprián-Matthews, the first Latina to lead the news division, was inducted into the National Association of Hispanic Journalists' Hall of Fame.","url":"https://www.cbsnews.com/news/cbs-news-president-ingrid-ciprian-matthews-nahj-hall-of-fame/","publishedAt":"2024-07-18T12:45:40Z","SourceName":"cbsnews"},{"title":"JD Vance speaks at RNC, accepting nomination for vice president","description":"Donald Trump's vice presidential nominee, JD Vance, spoke at the Republican National Convention Wednesday, formally accepting the GOP's nomination. In his speech, Vance made an appeal to working-class Americans and went after President Biden. Trump is expected to speak at the convention Thursday.","url":"https://www.cbsnews.com/video/jd-vance-speaks-at-rnc-accepting-nomination-for-vice-president/","publishedAt":"2024-07-18T12:40:00Z","SourceName":"cbsnews"},{"title":"New calls for Biden to step down from candidacy as he battles COVID","description":"President Biden cut a campaign trip short Wednesday after he tested positive for COVID. The president was in Nevada trying to shore up support in the battleground state. Meanwhile, he faces new calls to step down from the candidacy, including from California Rep. Adam Schiff.","url":"https://www.cbsnews.com/video/new-calls-for-biden-to-step-down-from-candidacy-as-he-battles-covid/","publishedAt":"2024-07-18T12:39:00Z","SourceName":"cbsnews"},{"title":"The message Republicans are trying to spread with JD Vance","description":"JD Vance officially accepted the Republican nomination for vice president Wednesday night, discussing his Rust Belt roots and family while addressing the Republican National Convention. CBS News campaign reporter Olivia Rinaldi has more on why the GOP and Donald Trump picked Vance for the ticket.","url":"https://www.cbsnews.com/video/the-message-republicans-are-trying-to-spread-with-jd-vance/","publishedAt":"2024-07-18T12:36:00Z","SourceName":"cbsnews"},{"title":"See the full list of Kennedy Center honorees","description":"\"CBS Mornings\" got an exclusive first look at the 47th class of Kennedy Center honorees, who will be celebrated for their lifetime artistic achievements and impact on American culture.","url":"https://www.cbsnews.com/news/2024-kennedy-center-honorees-include-grateful-dead-bonnie-raitt-among-others/","publishedAt":"2024-07-18T12:35:39Z","SourceName":"cbsnews"},{"title":"2024 Kennedy Center honorees revealed on \"CBS Mornings\"","description":"The 47th class of Kennedy Center honorees was revealed on \"CBS Mornings\" Thursday. The star-studded list of recipients includes award-winning filmmaker Francis Ford Coppola, legendary rock band the Grateful Dead, blues rock singer-songwriter Bonnie Raitt, jazz musician and composer Arturo Sandoval and the Apollo.","url":"https://www.cbsnews.com/video/2024-kennedy-center-honorees-revealed-on-cbs-mornings/","publishedAt":"2024-07-18T11:53:00Z","SourceName":"cbsnews"},{"title":"Arrests made after woman's body found in toolbox in Vermont river","description":"Kayla Wright's body was found in a truck-bed-style toolbox on a sandbar in the Missisquoi River in February.","url":"https://www.cbsnews.com/news/kayla-wright-murder-arrests-body-found-toolbox-missisquoi-river-vermont/","publishedAt":"2024-07-18T11:08:00Z","SourceName":"cbsnews"},{"title":"RNC Day 4: Trump to accept GOP presidential nomination","description":"Former President Donald Trump is slated to accept the GOP's nomination for president on the fourth and last day of the Republican National Convention.","url":"https://www.cbsnews.com/news/rnc-day-4-speakers-schedule/","publishedAt":"2024-07-18T11:00:12Z","SourceName":"cbsnews"},{"title":"Alabama set to execute convicted murderer, then skip autopsy","description":"A man convicted of killing a delivery driver who stopped for cash at an ATM to take his wife to dinner is scheduled for execution in Alabama, which has agreed to forgo the usual post-execution autopsy.","url":"https://www.cbsnews.com/news/alabama-set-to-execute-convicted-murderer-then-skip-post-execution-autopsy/","publishedAt":"2024-07-18T10:32:00Z","SourceName":"cbsnews"}]
