[{"title":"France’s Far Right Scores Big in First Round of Elections, Polling Suggests","description":"A surprise decision by President Emmanuel Macron to hold a snap election appears to have backfired badly, giving the National Rally a decisive victory.","url":"https://www.nytimes.com/2024/06/30/world/europe/france-elections.html","publishedAt":"2024-07-01T07:37:16Z","SourceName":"nytimes"},{"title":"Four Takeaways From France’s Snap Election","description":"It was a big day for the far-right National Rally. Just how big will not be clear until a second round of voting is over.","url":"https://www.nytimes.com/2024/07/01/world/europe/france-election-takeaways.html","publishedAt":"2024-07-01T08:07:16Z","SourceName":"nytimes"},{"title":"Biden’s Family Tells Him to Keep Fighting as They Huddle at Camp David","description":"President Biden is trying to figure out how to tamp down Democratic anxiety after last week’s disastrous debate performance.","url":"https://www.nytimes.com/2024/06/30/us/politics/biden-debate-anxious-democrats.html","publishedAt":"2024-07-01T01:19:26Z","SourceName":"nytimes"},{"title":"Nothing to See Here? White House Portrays Biden’s Debate Performance as a Blip","description":"Critics of the approach say it risks making President Biden and his campaign seem woefully out of touch with the voters they need to win.","url":"https://www.nytimes.com/2024/06/30/us/politics/biden-debate-trump-reaction.html","publishedAt":"2024-06-30T18:26:09Z","SourceName":"nytimes"},{"title":"Democrats Roll Out a Post-Debate Playbook to Help Biden Recover","description":"Surrogates on Sunday made the case for the president, who spent the weekend reassuring donors and supporters, with a message focused on his record and that of Donald J. Trump.","url":"https://www.nytimes.com/2024/06/30/us/politics/clyburn-graham-cnn.html","publishedAt":"2024-06-30T18:48:41Z","SourceName":"nytimes"},{"title":"Can Japan’s First Same-Sex Dating Reality Show Change Hearts and Minds?","description":"Producers of “The Boyfriend” on Netflix hope it will encourage broader acceptance of the L.G.B.T.Q. community in Japan, which still has not legalized same-sex unions.","url":"https://www.nytimes.com/2024/06/30/world/asia/the-boyfriend-netflix.html","publishedAt":"2024-06-30T15:01:09Z","SourceName":"nytimes"},{"title":"U.S.A. Gymnastics Uses Therapy Dogs at Olympic Trials to Help Athletes’ Mental Health","description":"Beacon, a golden retriever, began working with U.S.A. Gymnastics last year as part of the organization’s efforts to transform the sport’s toxic culture. More dogs quickly followed.","url":"https://www.nytimes.com/2024/06/28/us/olympics-gymnastics-therapy-dogs-mental-health.html","publishedAt":"2024-06-28T15:27:43Z","SourceName":"nytimes"},{"title":"Iranians Say Elections Bring Little Change, So Why Vote?","description":"In Tehran, many Iranians said they didn’t see the point in voting in Friday’s first-round presidential election since all the candidates had been vetted by the government.","url":"https://www.nytimes.com/2024/06/30/world/middleeast/iran-election-president-voters.html","publishedAt":"2024-06-30T21:00:31Z","SourceName":"nytimes"},{"title":"How Science Went to the Dogs (and Cats)","description":"Pets were once dismissed as trivial scientific subjects. Today, companion animal science is hot.","url":"https://www.nytimes.com/2024/06/30/science/pets-research-dogs-cats.html","publishedAt":"2024-06-30T07:00:23Z","SourceName":"nytimes"},{"title":"Boeing Agrees to Buy Spirit AeroSystems, a Longtime Supplier","description":"The multibillion-dollar deal will reverse a decision the plane maker made two decades ago to outsource production of key parts to independent suppliers.","url":"https://www.nytimes.com/2024/07/01/business/boeing-spirit-aerosystems-acquisition.html","publishedAt":"2024-07-01T04:53:32Z","SourceName":"nytimes"},{"title":"U.S. Said to Seek Boeing Guilty Plea to Avoid Trial in 737 Max Crashes","description":"The Justice Department told victims’ families that it would propose a nearly $244 million fine and three years of company oversight to settle a fraud charge.","url":"https://www.nytimes.com/2024/06/30/business/boeing-max-justice-department.html","publishedAt":"2024-06-30T23:19:29Z","SourceName":"nytimes"},{"title":"Soma Golden Behr, 84, Dies; Inspired Enterprising Journalism at The Times","description":"The first woman to serve as the paper’s national editor, she focused on issues of race, class and poverty, drawing prizes, and rose to the newsroom’s top echelon.","url":"https://www.nytimes.com/2024/06/30/business/media/soma-golden-behr-dead.html","publishedAt":"2024-07-01T04:26:52Z","SourceName":"nytimes"},{"title":"This Isn’t All Joe Biden’s Fault","description":"What is the Democratic Party for if not for dealing with a situation like this?","url":"https://www.nytimes.com/2024/06/30/opinion/biden-debate-convention.html","publishedAt":"2024-06-30T12:36:58Z","SourceName":"nytimes"},{"title":"The Ghastly vs. the Ghostly","description":"Do the Democrats really want to stop Trump? What are they prepared to do?","url":"https://www.nytimes.com/2024/06/29/opinion/biden-debate-president-exit.html","publishedAt":"2024-06-30T00:18:54Z","SourceName":"nytimes"},{"title":"To Serve His Country, President Biden Should Leave the Race","description":"The president’s inadequate performance in the debate made it clear he is not the man he was four years ago.","url":"https://www.nytimes.com/2024/06/28/opinion/biden-election-debate-trump.html","publishedAt":"2024-06-29T02:05:34Z","SourceName":"nytimes"},{"title":"The ‘Bad Debate’ Nonsense","description":"Biden’s problems are far more serious than a single night’s poor performance.","url":"https://www.nytimes.com/live/2024/06/25/opinion/thepoint/biden-debate-cognitive-decline","publishedAt":"2024-06-30T13:17:35Z","SourceName":"nytimes"},{"title":"Hurricane Beryl Threatens the Caribbean as a Category 3 Storm","description":"The tropical cyclone was the earliest in a season to strengthen to a Category 4 hurricane in the Atlantic. It later weakened slightly.","url":"https://www.nytimes.com/article/tropical-storm-beryl-hurricane.html","publishedAt":"2024-07-01T07:37:22Z","SourceName":"nytimes"},{"title":"China Dangled Rebates to Lure People to Spend. It’s Not Enough.","description":"China’s leaders vowed to kick-start spending by offering subsidies for households to buy cars and appliances. But many consumers aren’t biting.","url":"https://www.nytimes.com/2024/07/01/business/china-cash-for-clunkers.html","publishedAt":"2024-07-01T04:01:10Z","SourceName":"nytimes"},{"title":"Along the Hollywood Walk of Fame, a Struggle to Make a Living","description":"Los Angeles lifted restrictions that had forced street vendors, mostly immigrants, on Hollywood Boulevard to dodge citations. Other challenges remain.","url":"https://www.nytimes.com/2024/06/29/business/economy/hollywood-street-vendors.html","publishedAt":"2024-06-29T09:01:00Z","SourceName":"nytimes"},{"title":"Myanmar Shop Owners Are Being Jailed for Increasing Wages","description":"Myanmar’s junta, facing a growing popular rebellion, has plunged the country into economic crisis, reversing gains from a decade of civilian leadership.","url":"https://www.nytimes.com/2024/07/01/world/asia/myanmar-junta-inflation-arrests.html","publishedAt":"2024-07-01T06:14:20Z","SourceName":"nytimes"},{"title":"Anything Can Happen, and Usually Does, on ‘Watch What Happens Live’","description":"With Andy Cohen, Hillary Clinton will do shots and Oscar-winners gush about reality stars — all savvy promotion for Bravo’s outrageous TV universe.","url":"https://www.nytimes.com/2024/06/30/arts/television/watch-what-happens-live-anniversary.html","publishedAt":"2024-06-30T09:00:43Z","SourceName":"nytimes"},{"title":"Kamala Harris Rapidly Picks Up Democratic Support as 2024 Race Is Reborn","description":"Endorsements cascaded in as the vice president took swift control of the Biden campaign in a transformed contest, though Democrats including Barack Obama did not immediately back her.","url":"https://www.nytimes.com/2024/07/21/us/politics/harris-democrats-campaign-nominee-biden.html","publishedAt":"2024-07-22T02:38:28Z","SourceName":"nytimes"},{"title":"Timeline: Inside the Weekend When Biden Decided to Withdraw","description":"President Biden did not tell most of his staff until a minute before making his announcement to the world on social media on Sunday. Vice President Kamala Harris, whom Mr. Biden went on to endorse, also learned of his decision on Sunday.","url":"https://www.nytimes.com/2024/07/21/us/politics/biden-withdrawal-timeline.html","publishedAt":"2024-07-22T01:54:44Z","SourceName":"nytimes"},{"title":"On the Trail With Trump, Vance Shows He Knows His Place: Offstage, Mostly","description":"JD Vance, the Republican nominee for vice president, was a mere warm-up act to Donald J. Trump at their first joint rally.","url":"https://www.nytimes.com/2024/07/21/us/politics/vance-trump-campaign-rally.html","publishedAt":"2024-07-21T19:36:00Z","SourceName":"nytimes"},{"title":"Inside the ‘Gangster’ Image of Donald Trump","description":"Former President Donald J. Trump has an aggressive — and some argue offensive — campaign using hip-hop and rap to reach young Black and Latino voters.","url":"https://www.nytimes.com/2024/07/21/us/politics/donald-trump-hiphop.html","publishedAt":"2024-07-21T09:00:46Z","SourceName":"nytimes"},{"title":"Trump’s Conviction and Biden’s Poor Debate Sent Big Money Into the Race","description":"The Biden campaign also spent six times as much as the Trump campaign did in June, allowing Republicans to gain a financial advantage.","url":"https://www.nytimes.com/2024/07/20/us/politics/trump-biden-fundraising.html","publishedAt":"2024-07-21T06:20:35Z","SourceName":"nytimes"},{"title":"Homeland Security Announces Panel on Trump Assassination Attempt","description":"Secretary Alejandro N. Mayorkas said the bipartisan group of experts would get to the bottom of decisions that allowed a gunman to wound the former president at a rally in Pennsylvania.","url":"https://www.nytimes.com/2024/07/21/us/politics/panel-trump-assassination-attempt.html","publishedAt":"2024-07-22T01:04:55Z","SourceName":"nytimes"},{"title":"Campus Protests Led to More Than 3,100 Arrests, but Many Charges Have Been Dropped","description":"The spate of pro-Palestinian protests and encampments engulfed academic institutions of all sizes in nearly every part of the country.","url":"https://www.nytimes.com/2024/07/21/us/campus-protests-arrests.html","publishedAt":"2024-07-22T02:20:58Z","SourceName":"nytimes"},{"title":"Israel Intercepts Missile Fired From Yemen as Conflict With Houthis Continues","description":"The missile launch suggested that the Yemen-based Houthi militia, which is backed by Iran, would keep up its attacks despite Israeli airstrikes on a port it controls.","url":"https://www.nytimes.com/2024/07/21/world/middleeast/israel-houthis-missile-yemen.html","publishedAt":"2024-07-21T20:00:24Z","SourceName":"nytimes"},{"title":"Corvette Bucked a Sports Cars Decline. Can It Thrive in an E.V. Era?","description":"The General Motors sports car, which enjoyed strong sales after a big design change, now has a hybrid version and may get a fully electric model that may turn off some gas-loving customers.","url":"https://www.nytimes.com/2024/07/21/business/chevrolet-corvette-electric-vehicles.html","publishedAt":"2024-07-21T09:01:44Z","SourceName":"nytimes"},{"title":"Parts of Oregon, Washington and Idaho Under Extreme Heat Warning","description":"After a blistering weekend, particularly in inland areas farther from the coast, cooler temperatures are expected beginning early this week.","url":"https://www.nytimes.com/2024/07/21/us/heat-wave-forecast-washington-oregon-idaho.html","publishedAt":"2024-07-22T03:23:36Z","SourceName":"nytimes"},{"title":"Pacific Northwest Faces Critical Fire Risk as Wildfires Burn","description":"More than half a million people were under fire danger warnings on Sunday as a heat wave hit the region and several large blazes burned in Oregon.","url":"https://www.nytimes.com/2024/07/21/us/wildfires-lightning-oregon-washington.html","publishedAt":"2024-07-21T22:36:07Z","SourceName":"nytimes"},{"title":"Joe Biden’s Extraordinary Example of Dropping Out","description":"It’s hard to grasp the historical rarity, emotional agony and fundamental humility of what the president just did.","url":"https://www.nytimes.com/2024/07/21/opinion/joe-biden-drops-out-2024-history.html","publishedAt":"2024-07-21T20:17:19Z","SourceName":"nytimes"},{"title":"Can Kamala Harris Step Up? Asking for a Friend.","description":"What are the alternatives? And about those Republicans ...","url":"https://www.nytimes.com/2024/07/21/opinion/kamala-harris-joe-biden-drops-out.html","publishedAt":"2024-07-22T00:41:55Z","SourceName":"nytimes"},{"title":"Kamala Harris or Bust","description":"The only conversation the Democrats need to be having now is about how to line up behind their vice president.","url":"https://www.nytimes.com/2024/07/09/opinion/kamala-harris-replace-biden.html","publishedAt":"2024-07-21T22:32:57Z","SourceName":"nytimes"},{"title":"Delta Flight Cancellations Continue As It Struggles To Recover From Tech Outage","description":"Transportation Secretary Pete Buttigieg singled out the airline on Sunday for continued disruptions and “unacceptable” customer service as it canceled another 1,300 flights.","url":"https://www.nytimes.com/2024/07/22/business/delta-global-tech-outage-pete-buttigieg.html","publishedAt":"2024-07-22T07:01:09Z","SourceName":"nytimes"},{"title":"Bangladesh Protests Inequality of Opportunity","description":"Demonstrations set off by the reinstatement of a quota system for government jobs revealed broader resentment about the uneven distribution of wealth and opportunity.","url":"https://www.nytimes.com/2024/07/21/world/asia/bangladesh-protests-quotas-jobs.html","publishedAt":"2024-07-22T03:24:33Z","SourceName":"nytimes"},{"title":"Tadej Pogacar Wins the Tour de France for the Third Time","description":"Pogacar won his third Tour, beating his rival Jonas Vingegaard by 6:17 after a final time trial victory in Nice on Sunday.","url":"https://www.nytimes.com/2024/07/21/sports/cycling/pogacar-tour-de-france.html","publishedAt":"2024-07-21T18:54:05Z","SourceName":"nytimes"},{"title":"Soho Waiters Race Keeps London Servers on Their Toes","description":"Waiters in London competed in an annual footrace designed to test their mettle, their coordination and their skill as servers.","url":"https://www.nytimes.com/2024/07/21/world/europe/soho-london-waiters-race.html","publishedAt":"2024-07-21T23:03:35Z","SourceName":"nytimes"},{"title":"These Sculptures Changed What Art Could Be, Then Changed Themselves","description":"Eva Hesse’s latex and fiberglass pieces from the late 1960s have been reunited from five institutions. Their rapid deterioration makes their future uncertain — which may be their best quality.","url":"https://www.nytimes.com/2024/07/19/arts/design/eva-hesse-sculptures-hauser-wirth.html","publishedAt":"2024-07-19T11:03:29Z","SourceName":"nytimes"},{"title":"Israeli Strike on Yemeni Port Will Harm Civilians, Not Houthis, Experts Say","description":"Israel’s counterattack on the Houthis, which set a vital Yemeni port ablaze, will do little to deter the militia, Yemeni and international experts said.","url":"https://www.nytimes.com/2024/07/21/world/middleeast/israel-yemen-hudaydah-port.html","publishedAt":"2024-07-21T15:52:13Z","SourceName":"nytimes"},{"title":"Democrats Weigh the Pros and Cons of Kamala Harris’s Candidacy","description":"In a sprint of a race, Ms. Harris is poised to attack Donald Trump on his felonies and, in a 2024 twist, his age, but Republicans will be galvanized to fight her, too.","url":"https://www.nytimes.com/2024/07/22/us/politics/kamala-harris-democratic-nominee.html","publishedAt":"2024-07-22T04:56:39Z","SourceName":"nytimes"},{"title":"Top Democrats Swing Behind Harris after Biden Exits Race","description":"Plus, Secret Service chief to face a House hearing.","url":"https://www.nytimes.com/2024/07/22/podcasts/biden-withdraws-harris.html","publishedAt":"2024-07-22T10:00:11Z","SourceName":"nytimes"},{"title":"Secret Service Director, Kimberly Cheatle, to Face Questions on Agency’s Failures in Hearing","description":"Kimberly A. Cheatle will appear before a House committee amid criticism over the way her agency handled security for the rally at which former President Donald J. Trump was injured by a would-be assassin.","url":"https://www.nytimes.com/2024/07/22/us/politics/kimberly-cheatle-hearing-secret-service.html","publishedAt":"2024-07-22T09:04:42Z","SourceName":"nytimes"},{"title":"What Does a City Get Back From Hosting the Olympics?","description":"The Games are supposed to be a fast track to urban renewal. The reality is often the opposite.","url":"https://www.nytimes.com/2024/07/22/magazine/olympics-city-redevelopment-paris.html","publishedAt":"2024-07-22T09:02:59Z","SourceName":"nytimes"},{"title":"When Sports Games Feel Like Casinos, Players Rarely Win","description":"Popular franchises like NBA 2K, FC and Madden entice players to keep spending. Critics say it’s ruining the games.","url":"https://www.nytimes.com/2024/07/22/arts/sports-madden-fc-nba2k-microtransactions.html","publishedAt":"2024-07-22T09:00:22Z","SourceName":"nytimes"},{"title":"What’s the Matter With Madden?","description":"After ESPN NFL 2K5 came out swinging in a battle of revered football video games, Madden scored an exclusive N.F.L. license. Twenty years later, its ratings are dismal.","url":"https://www.nytimes.com/2024/07/22/arts/madden-nfl-2k5-exclusive-license.html","publishedAt":"2024-07-22T09:00:21Z","SourceName":"nytimes"},{"title":"Readers Share Their Favorite Sports Video Games (Boomshakalaka!)","description":"NHL ’94 and MVP Baseball 2005 live on decades later. So do the arcade-style games NBA Jam and Mario Tennis.","url":"https://www.nytimes.com/2024/07/22/arts/readers-favorite-sports-video-games.html","publishedAt":"2024-07-22T09:00:47Z","SourceName":"nytimes"},{"title":"Heat Waves Are Pounding Egypt, and Often There’s No A.C.","description":"Daily power cuts have been plaguing Egypt during an extraordinarily hot summer. Now the blackouts may be temporarily suspended, but the damage to confidence in the government has already been done.","url":"https://www.nytimes.com/2024/07/22/world/middleeast/egypt-heat-wave-summer-power-cuts.html","publishedAt":"2024-07-22T09:02:16Z","SourceName":"nytimes"},{"title":"A Deadly Robbery Reveals a Pattern of Targeting Latinos in Alabama’s Capital","description":"Latinos in Montgomery, Ala., said they had been sounding the alarm for months, describing the killings at a grocery store as the culmination of unchecked violence.","url":"https://www.nytimes.com/2024/07/22/us/robberies-latinos-montgomery-alabama.html","publishedAt":"2024-07-22T09:01:18Z","SourceName":"nytimes"},{"title":"Can Robert Menendez’s Bribery Conviction Survive an Appeal?","description":"The Supreme Court has narrowed the legal definition of corruption, with political figures in New York and elsewhere having their convictions overturned as a result.","url":"https://www.nytimes.com/2024/07/22/nyregion/robert-menendez-bribery-conviction-appeal.html","publishedAt":"2024-07-22T07:00:07Z","SourceName":"nytimes"},{"title":"Joe Biden, My Friend and an American Hero","description":"He never surrendered the hope that a frail and fallible world could be made stronger if people could summon enough goodness and courage to build, rather than tear down.","url":"https://www.nytimes.com/2024/07/22/opinion/joe-biden-american-hero.html","publishedAt":"2024-07-22T09:03:44Z","SourceName":"nytimes"},{"title":"Biden Made a Courageous Choice in Dropping Out","description":"He did what Trump would never do: place the national interest above his own pride and ambition.","url":"https://www.nytimes.com/2024/07/21/opinion/editorials/joe-biden-drops-out-courage.html","publishedAt":"2024-07-22T10:13:52Z","SourceName":"nytimes"},{"title":"Al Sharpton: Kamala Harris Can Preserve Biden’s Legacy","description":"History will remember what this former lion of the Senate accomplished from the West Wing to improve Black communities across the nation.","url":"https://www.nytimes.com/2024/07/22/opinion/al-sharpton-kamala-harris.html","publishedAt":"2024-07-22T12:28:04Z","SourceName":"nytimes"},{"title":"Kamala Harris Takes Control","description":"President Biden has dropped out of the race. We answer four questions about what happens next.","url":"https://www.nytimes.com/2024/07/22/briefing/biden-harris-election-trump.html","publishedAt":"2024-07-22T12:01:41Z","SourceName":"nytimes"},{"title":"E.P.A. Announces $4.3 Billion in Funding for 25 Climate Projects","description":"States, tribes, local governments and territories sent in proposals aimed at cutting greenhouse gas emissions.","url":"https://www.nytimes.com/2024/07/22/climate/epa-climate-change-money.html","publishedAt":"2024-07-22T09:03:24Z","SourceName":"nytimes"},{"title":"Esta TerBlanche, ‘All My Children’ Star, Dies at 51","description":"Ms. TerBlanche played Gillian Andrassy, a Hungarian princess whose story line was beloved by fans.","url":"https://www.nytimes.com/2024/07/21/arts/esta-terblanche-dead.html","publishedAt":"2024-07-22T02:54:03Z","SourceName":"nytimes"},{"title":"Street Style Looks From a New York Summer","description":"New Yorkers have found plenty of ways to navigate heat waves in style.","url":"https://www.nytimes.com/2024/07/20/style/its-hot-out-people-still-look-good.html","publishedAt":"2024-07-20T09:02:22Z","SourceName":"nytimes"},{"title":"Harris Steps Into the Spotlight, Reintroducing Herself on Her Own Terms","description":"Vice President Kamala Harris scooped up endorsements and wasted no time starting to build her new profile as the presumptive nominee and the new hope for defeating former President Donald J. Trump.","url":"https://www.nytimes.com/2024/07/22/us/politics/kamala-harris-campaign.html","publishedAt":"2024-07-22T21:05:22Z","SourceName":"nytimes"},{"title":"How Kamala Harris Will Try to Put Trump on Defense","description":"Democrats are eager for her to deploy lines of attack that come more naturally than they did for President Biden, including on issues like abortion rights and the rule of law.","url":"https://www.nytimes.com/2024/07/22/us/politics/kamala-harris-trump-presidential-election.html","publishedAt":"2024-07-22T20:42:57Z","SourceName":"nytimes"},{"title":"Harris Raises More Than $50 Million as Biden’s 2024 Race Exit Unleashes Cash Wave","description":"The funds will help rebuild a Democratic war chest that was at risk of being depleted in the weeks of uncertainty after President Biden’s poor debate, as big donors put a pause on fund-raising.","url":"https://www.nytimes.com/2024/07/22/us/politics/harris-fundraising-biden-actblue.html","publishedAt":"2024-07-22T22:33:10Z","SourceName":"nytimes"},{"title":"Lawmakers Call on Secret Service Director Kimberly Cheatle to Step Down at Hearing","description":"In a hearing on Capitol Hill, Director Kimberly A. Cheatle declined to answer questions about the lapses in protection that allowed a gunman to fire at former President Donald Trump in Butler, Pa.","url":"https://www.nytimes.com/2024/07/22/us/politics/kimberly-cheatle-secret-service-hearing.html","publishedAt":"2024-07-22T21:55:13Z","SourceName":"nytimes"},{"title":"The Questions Secret Service Director, Kimberly Cheatle, Did Not Answer","description":"On Monday, Kimberly A. Cheatle told a House committee that she could not reveal — or did not know — key details about the attempted assassination of President Trump. Here’s what was missing.","url":"https://www.nytimes.com/2024/07/22/us/politics/kimberly-cheatle-secret-service-hearing-questions.html","publishedAt":"2024-07-22T19:17:54Z","SourceName":"nytimes"},{"title":"Israel Risks All-Out War With Hezbollah. A Truce in Gaza May Reduce That Threat.","description":"After nine months of low-level conflict between Israel and Hezbollah, the risk of all-out war is higher than ever. A cease-fire in Gaza would provide an offramp for both sides, diplomats say.","url":"https://www.nytimes.com/2024/07/22/world/middleeast/israel-hezbollah-gaza-war.html","publishedAt":"2024-07-22T15:54:53Z","SourceName":"nytimes"},{"title":"Netanyahu, Who Clashed With Biden, Prepares for a Delicate Farewell","description":"The Israeli prime minister could expect a freer hand if Donald J. Trump returns to the presidency. But he must rely on President Biden for another six months.","url":"https://www.nytimes.com/2024/07/22/world/middleeast/netanyahu-biden-israel-gaza-congress.html","publishedAt":"2024-07-22T23:28:09Z","SourceName":"nytimes"},{"title":"How the Paris 2024 Olympic Village Feeds Its Athletes","description":"The French will have to meet a welter of health and cultural requirements, but they still want to serve up some delight.","url":"https://www.nytimes.com/2024/07/22/dining/olympic-village-paris-2024-food.html","publishedAt":"2024-07-22T09:02:34Z","SourceName":"nytimes"},{"title":"The Decathlete Who Picked Up a Gun","description":"About 500 top-level Ukrainian athletes and coaches have died in the war. Volodymyr Androshchuk promised his loved ones he would make it back.","url":"https://www.nytimes.com/2024/07/22/world/olympics/ukraine-war-athletes-dead.html","publishedAt":"2024-07-22T12:13:15Z","SourceName":"nytimes"},{"title":"‘Barbie’ Was Supposed to Change Hollywood for Women. Why Didn’t It?","description":"The film was a global phenomenon and seemed to herald a new era of embracing stories by, about and for women.","url":"https://www.nytimes.com/2024/07/22/business/media/barbie-movie-hollywood.html","publishedAt":"2024-07-22T13:38:49Z","SourceName":"nytimes"},{"title":"Ethics Committee Moves Swiftly to Tee Up Possible Expulsion of Menendez","description":"Senator Robert Menendez of New Jersey was found guilty of bribery and corruption last week.","url":"https://www.nytimes.com/2024/07/22/nyregion/robert-menendez-bribery-ethics-vote.html","publishedAt":"2024-07-22T21:18:44Z","SourceName":"nytimes"},{"title":"Darren Walker, Who Reoriented the Ford Foundation, Will Step Down","description":"Mr. Walker, who oversaw $7 billion in grants, plans to leave at the end of 2025 after what will have been 12 years.","url":"https://www.nytimes.com/2024/07/22/arts/darren-walker-ford-foundation-stepping-down.html","publishedAt":"2024-07-22T17:26:52Z","SourceName":"nytimes"},{"title":"What Are Kamala Harris’s Strengths and Weaknesses? Four Columnists Discuss.","description":"As Democratic leaders fall in line behind Harris, her strengths and weaknesses warrant a closer look.","url":"https://www.nytimes.com/2024/07/22/opinion/kamala-harris-democrats.html","publishedAt":"2024-07-22T19:44:24Z","SourceName":"nytimes"},{"title":"Trump’s Cynical Attempt to Pit Recent Immigrants Against Black Americans","description":"No, Black workers aren’t being “decimated” by new immigrants.","url":"https://www.nytimes.com/2024/07/22/opinion/trump-immigration-black-voters.html","publishedAt":"2024-07-22T23:00:14Z","SourceName":"nytimes"},{"title":"What Joe Biden Knows: ‘Politics Is About Tomorrow, Not Yesterday.’","description":"Joe Biden must have accepted that he is yesterday, and chose to let the party move on.","url":"https://www.nytimes.com/2024/07/22/opinion/joe-biden-lyndon-johnson-truman.html","publishedAt":"2024-07-22T22:01:50Z","SourceName":"nytimes"},{"title":"Democrats Cleared the Path for Harris’s Nomination","description":"Also, lawmakers called for the Secret Service director to resign. Here’s the latest at the end of Monday.","url":"https://www.nytimes.com/2024/07/22/briefing/democrats-kamala-harris-secret-service-director.html","publishedAt":"2024-07-22T21:25:04Z","SourceName":"nytimes"},{"title":"Women Voters: Is the Country Ready for a Female President? Tell Us.","description":"Let us know how you feel about a woman running for president in 2024.","url":"https://www.nytimes.com/2024/07/22/us/women-voters-female-president-feedback.html","publishedAt":"2024-07-22T23:10:27Z","SourceName":"nytimes"},{"title":"Trial Set to Start Next Year in Bombing of U.S.S. Cole","description":"The judge reserved a courtroom for fall 2025. Seventeen U.S. sailors were killed in the bombing, which was a precursor to the 9/11 terrorist attacks.","url":"https://www.nytimes.com/2024/07/22/us/politics/uss-cole-bombing-trial.html","publishedAt":"2024-07-22T19:01:51Z","SourceName":"nytimes"},{"title":"Russia Sentences Alsu Kurmasheva, American Editor, to a Penal Colony","description":"Ms. Kurmasheva, a Russian American working for Radio Free Europe/Radio Liberty, had been charged in relation to an antiwar book she edited.","url":"https://www.nytimes.com/2024/07/22/world/europe/alsu-kurmasheva-sentence-russia.html","publishedAt":"2024-07-22T18:11:03Z","SourceName":"nytimes"},{"title":"SoftBank’s Chief Pitches a New Path for Self-Driving Cars","description":"Masayoshi Son, the billionaire founder of SoftBank, is trying to rally automakers around the world to join forces on autonomous-driving technologies.","url":"https://www.nytimes.com/2024/07/22/business/softbank-self-driving-cars.html","publishedAt":"2024-07-22T15:40:42Z","SourceName":"nytimes"},{"title":"Duke Fakir, Last Surviving Member of the Four Tops, Dies at 88","description":"He sang tenor on hits like “Standing in the Shadow of Love,” “Reach Out, I’ll Be There” and “I Can’t Help Myself (Sugar Pie Honey Bunch).”","url":"https://www.nytimes.com/2024/07/22/arts/music/abdul-duke-fakir-dead.html","publishedAt":"2024-07-22T21:10:03Z","SourceName":"nytimes"},{"title":"How ‘Twisters’ Destroys a Motel","description":"The director Lee Isaac Chung narrates a sequence from the film featuring Daisy Edgar-Jones and Glen Powell, in which a building is leveled by a tornado.","url":"https://www.nytimes.com/2024/07/19/movies/twisters-clip.html","publishedAt":"2024-07-20T00:22:06Z","SourceName":"nytimes"}]
